{"img":{"i363314be":{"src":"/assets/images/mario-andrews.png","alt":"","sizes":""},"in555f2e74":{"src":"/assets/images/group-229.png","alt":"","sizes":""},"in556d45f5":{"src":"/assets/images/group-228.png","alt":"","sizes":""}},"link":{"a23":"#","a54b5dee5":"#education"},"text":{"tn7e35c858":"Attorney Mario Andrews","t2268ff":"Home","t2311ad44":"\n            <a href=\"/\" class=\"breadcrumb-links\" data-text=\"t2268ff\">Home</a> » Attorney Mario Andrews\n          ","tn629dfab6":"Mario Andrews","tn2bf5a469":"ATTORNEY AT LAW","t491d2471":"About Mario","t661d8788":"Education","t5a0ea5a1":"Thank you! Your submission has been received!","tn7c112e99":"Oops! Something went wrong while submitting the form.","tn7d6c0869":"Attorney At Law","tn19ccce05":"Former Prosecutor and Police Officer on Your Side","tn261ee75f":"Fighting Police Misconduct","tn3f576105":"Mr. Andrews received his BA degree from San Francisco State and his law degree from Hastings College of Law, which is recognized as one of the best. Mr. Andrews has the experience, education and track record that you want on your side."},"textarea":{"ta170f068d":"Request a Free <br>Consultation","tan545a8942":"It is no mystery why Mario Andrews gets extraordinary results for Summit Defense clients. Mr. Andrews is the perfect storm in the world of criminal defense…a former police officer, investigator, and prosecutor. Very few defense attorneys have a better understanding of how the other side works.<br><br>This background benefits Summit Defense clients in many ways. If a case is in the pre-file stage (no charges have been filed yet), Mario can anticipate how the police will conduct their investigation and can advise you appropriately. If we’re preparing for trial, Mr. Andrew’s years as a prosecutor gives him the insight to poke holes in the state’s case until it crumbles.<br><br>","ta30a63f6f":"During Mr. Andrews time as a prosecutor, he spent four years working on the Oakland Citizen’s Police Review Board and even chaired it one year. This is an agency that monitors police misconduct and responds to complaints about possible abuses. This experience led Mario to realize that he wanted to work on the other side….to defend individual’s rights.<br><br>Mario has always been dedicated to children and to the community. During his time as a police officer, he spent time teaching classes at schools. He has also served as a board member of both the East Oakland Youth Development Center and of Scholar Athletes, Inc.<br>"},"richtext":{},"iframe":{}}