{"img":{},"link":{},"text":{"t3f15e75d":"DOMESTIC VIOLENCE","t2268ff":"Home","tn665ddcfa":"\n            <a href=\"/\" class=\"breadcrumb-links\" data-text=\"t2268ff\">Home</a> » Choosing a Bay Area Defense Lawyer\n          "},"textarea":{},"richtext":{"rn3860c019":"\n            <h1>Domestic Violence Laws in California</h1>\n            <h2>BAY AREA DOMESTIC VIOLENCE ATTORNEYS</h2>\n            <ul role=\"list\">\n              <li>Ex Prosecutors and Police officers now on your side</li>\n              <li>Aggressive Domestic Violence Lawyers</li>\n              <li>Immigration Safe Plea Negotiations</li>\n              <li>Offices in San Jose, Redwood City, San Francisco and Oakland</li>\n              <li>OUR GOAL IS THE DISMISSAL OF THE CASE</li>\n            </ul>\n            <figure style=\"padding-bottom:75%\" class=\"w-richtext-align-fullwidth w-richtext-figure-type-video\">\n              <div><iframe allowfullscreen=\"true\" frameborder=\"0\" scrolling=\"no\" src=\"https://www.youtube.com/embed/AMJHKac1Gig\" title=\"Domestic Violence: Pleasanton Criminal Defense Attorney Steve Davidson of Summit Defense Attorneys\"></iframe></div>\n            </figure>\n            <p>‍</p>\n            <h3>What are the consequences of a domestic violence conviction in California?</h3>\n            <p>A Domestic Violence conviction will carry very<a href=\"https://www.summitdefense.com/criminal-process/criminal-conviction-consequences/\"><strong> serious consequences</strong></a> – including jail time, the imposition of <a href=\"https://www.summitdefense.com/domestic-violence/violation-of-restraining-orders/\"><strong>restraining orders</strong></a>, loss of child custody, and a permanent criminal record. In the case of non-citizens, <a href=\"https://www.summitdefense.com/domestic-violence/non-citizens/\"><strong>immigration issues</strong></a> present even further difficulties. &nbsp; Whether you have a green card or H1B, F1 or other visa status, you must consider not only the implications in criminal court, but also the dire consequences should Immigration courts become aware of the conviction.</p>\n            <p>Whether a felony or a misdemeanor, any domestic violence charge must be taken seriously. Technically, even a first misdemeanor offense exposes a defendant to a potential one-year jail sentence, but in reality, that is almost never the result. The real battle, though, is in protecting the clean record and reputation of the defendant. &nbsp;We know that even a first-time conviction can lead to serious consequences and affect your employment prospects, your good name, burden you with a permanent criminal record, impose a restraining order and compromise your immigration status. This is why out objective is the full dismissal of all charges. Where that is not possible, we are skilled as minimizing consequences to protect your reputation.</p>\n            <p> </p>\n            <h3>What are the most common domestic violence offenses and charges?</h3>\n            <p>While the most common type of domestic violence cases involves violence towards a spouse or significant other (spousal battery in violation of penal codes 273.5 or 243e), there are many types of domestic violence cases including: child endangerment, criminal threats, stalking as well as elder abuse. &nbsp;That is, so long as a crime is committed against a person that is “closely related” there is the potential that the District Attorney will charge the matter as a domestic violence case. &nbsp;Once charged, these cases are prosecuted aggressively even if the complaining party is uncooperative or recants his or her statement.</p>\n            <p>\n              <a href=\"https://www.summitdefense.com/domestic-violence/rights-of-victims/\"><strong>More on the rights of victims of domestic violence</strong></a>\n            </p>\n            <p>This page cover domestic violence laws in California; the criminal offenses and the laws related to restraining orders, as well as Law Enforcement and prosecution policies that impact these cases. We understand how the local police departments and courts treat these matters, and are experts in directing our clients to resources that are available to help deal with family conflict. Whether the result of financial or professional stress or issues surrounding child raising, families are under a lot of stress. &nbsp;We recognize that these people aren’t criminals, and our aim is always to protect our clients’ rights and reputation, and to keep families together wherever possible.</p>\n            <h3>The following are the most common domestic violence offenses:</h3>\n            <p>In the California Penal Code, there are two main offenses that relate specifically to incidents of domestic violence. They are:</p>\n            <ul role=\"list\">\n              <li>\n                <a href=\"https://www.summitdefense.com/domestic-violence/domestic-battery/\"><strong>Domestic battery, Penal Code 243(e)(1)</strong></a>, and\n              </li>\n              <li>\n                <a href=\"https://www.summitdefense.com/domestic-violence/corporal-injury-spouse-penal-code/\"><strong>Inflicting injury on spouse etc, Penal Code 273.5</strong></a><strong>.</strong>\n              </li>\n            </ul>\n            <p>Other offenses that can be charged in domestic violence cases include:</p>\n            <ul role=\"list\">\n              <li>\n                <a href=\"https://www.summitdefense.com/domestic-violence/violation-of-restraining-orders/\"><strong>Violation of restraining order, Penal Code 273.6</strong></a><strong>,</strong>\n              </li>\n              <li>\n                <a href=\"https://www.summitdefense.com/domestic-violence/child-endangerment/\"><strong>Child endangerment, Penal Code 273a(b)</strong></a><strong>,</strong>\n              </li>\n              <li>\n                <a href=\"https://www.summitdefense.com/criminal-process/criminal-threats/\"><strong>Making criminal threats, Penal Code 422</strong></a><strong>,</strong>\n              </li>\n              <li>\n                <a href=\"https://www.summitdefense.com/domestic-violence/false-imprisonment/\"><strong>False imprisonment, Penal Code 236 and 237</strong></a><strong>,</strong>\n              </li>\n              <li>\n                <a href=\"https://www.summitdefense.com/domestic-violence/types-of-cases/\"><strong>Kidnapping, Penal Code 207(a)</strong></a><strong>, and</strong>\n              </li>\n              <li>\n                <a href=\"https://www.summitdefense.com/domestic-violence/types-of-cases/\"><strong>Deprivation of child custody order, Penal Code 278.5</strong></a><strong>.</strong>\n              </li>\n            </ul>\n            <p> </p>\n            <h3>How is domestic violence defined in the state of California?</h3>\n            <p>Under California Penal Code 13700(b), domestic violence means “abuse committed against an adult or a minor who is a spouse, former spouse, cohabitant, former cohabitant, or person with whom the suspect has had a child or is having or has had a dating or engagement relationship.”</p>\n            <p>There are two important aspects to this definition:</p>\n            <ol role=\"list\">\n              <li>abuse; and</li>\n              <li>the specific kind of domestic relationship between the parties.</li>\n            </ol>\n            <p>The Penal Code goes on to define those terms.</p>\n            <p>Under Penal Code 13700(a), ‘abuse’ means “intentionally or recklessly causing or attempting to cause bodily injury, or placing another person in reasonable apprehension of imminent serious bodily injury to himself or herself, or another.”</p>\n            <p>The kinds of domestic relationships that the laws apply to are quite broad. They are:</p>\n            <ul role=\"list\">\n              <li>people who are married, or who used to be married;</li>\n              <li>people who have a child together;</li>\n              <li>people who are engaged or dating, or who used to be; and</li>\n              <li>people who live together – cohabitants – or who used to live together.</li>\n            </ul>\n            <p>Penal Code 13700(b) says that cohabitants are “two unrelated adult persons living together for a substantial period of time, resulting in some permanency of relationship.” It is not always clear if two people who live together are in the kind of domestic relationship that would fit under these laws, so in judging whether the couple fit the term ‘cohabitants’, the factors that can be taken into account include, but are not limited to:</p>\n            <ul role=\"list\">\n              <li>sexual relations between the parties while sharing the same living quarters,</li>\n              <li>sharing of income or expenses,</li>\n              <li>joint use or ownership of property,</li>\n              <li>whether the parties hold themselves out as husband and wife,</li>\n              <li>the continuity of the relationship, and</li>\n              <li>the length of the relationship.</li>\n            </ul>\n            <p> </p>\n            <h3>How do the California domestic violence laws work?</h3>\n            <p>The California Penal Code makes it a crime to use physical violence against your domestic partner, or to threaten them with physical violence. Of course it is illegal to assault anyone, but when the defendant and the alleged victim are in a special kind of relationship, the law treats that as a more serious kind of offense. Domestic violence offenses under Penal Code 243(e)(1) and 273.5 cover a very broad spectrum of relationships – the laws apply to spouses, people who are engaged, people who are living together in an intimate relationship, and in some cases even people who are dating. They also apply to couples who have separated and parents who have children together, whether they are still together or not. The law applies to both heterosexual couples and same-sex couples.</p>\n            <p>There are also laws that create a scheme for the imposition of restraining orders under both the Penal Code and the Family Code. These are orders that can be made against people who are accused or suspected of being violent or threatening violence against their current or former domestic partner. The orders are not, by themselves, a criminal charge – rather, they seek to restrain the behavior of the person who is seen as the aggressor in the relationship, in an effort to protect the other person.</p>\n            <p>The final aspect that is important to consider are the policies of the police and the prosecutors. Since specific domestic violence laws were passed in California in the 1980’s, police departments are required to enact special policies and protocols that, among other things, seek to prioritize the arrest of offenders. District Attorneys are also required to prioritize the prosecution of these matters.</p>\n            <p>The effect of these laws and policies, however, is that the pendulum has now swung too far – many people are arrested unfairly, when their partners do not want to take any action, or when families would be better served by sorting out their own problems. Another issue that arises in domestic violence responses today is that all incidents get ‘thrown in together’ in the system. This results in the courts being clogged by many cases that people could best deal with as a family, and not enough resources being directed to where they really should be, that is, focused on the most serious cases.</p>\n            <p>Finally, the legal system’s response to domestic violence means that it is not wise for a defendant to try to tackle accusations alone. The system is not set up to assist couples or families to help themselves through these cases – in fact, trying to do so can often make things worse. Every person accused of a domestic violence offense should obtain expert legal advice and representation to navigate the system effectively, and to protect their reputation.</p>\n            <p>If police get involved, arresting officers will make a felony arrest, which leads to felony bail, (usually $25,000 to $50,000). It is the District Attorney’s discretion to charge the case as a misdemeanor or a felony. It is highly likely that the District Attorney will charge the matter as a misdemeanor even if you were arrested for a felony.</p>\n            <p>\n              <a href=\"https://www.summitdefense.com/domestic-violence/hiring-domestic-violence-lawyer/\"><strong>What happens when police respond to a domestic violence call </strong></a>\n            </p>\n            <h3>What are the penalties for domestic violence in California?</h3>\n            <p>A domestic violence conviction can have very serious consequences – including jail time, the imposition of restraining orders, and a permanent criminal record, and in the case of non-citizens, immigration issues present even further difficulties. The Bay Area is a melting pot, and we regularly represent immigrants from all over the world. In those cases, our defense attorneys will work with the specialist immigration attorney on our team to prioritize the protection of our client’s immigration status. &nbsp;If you have already been convicted of a domestic violence offense, please <a href=\"https://www.summitdefense.com/domestic-violence/bay-area-resources/\"><strong>review local domestic violence resources here</strong></a>.</p>\n            <p>\n              <a href=\"https://www.summitdefense.com/domestic-violence/penalties/\"><strong>More on the penalties for domestic violence in California</strong></a>\n            </p>\n            <h3>How can I defend against domestic violence charges in California?</h3>\n            <p>As the largest Criminal Defense firm in the Bay Area, our Domestic Violence lawyers specialize in defending domestic violence cases. We believe that families have a right to sort out their own problems, and we do not want our clients to bear the burden of an unfair criminal conviction. Our first and foremost goal is the complete dismissal of charges. This is why we do everything possible to have these matters dismissed by the DA before charges are filed, and when necessary, vigorously defend domestic violence accusations in court. &nbsp;There are several recognized <a href=\"https://www.summitdefense.com/domestic-violence/defenses/\"><strong>defenses to domestic violence cases</strong></a> and our attorneys are versed in litigating these defenses.</p>\n            <p>We have eight locations in California’s bay area. Choose from the links below to find representation in your area:</p>\n            <p>\n              <a href=\"https://www.summitdefense.com/firm-locations/san-francisco/san-francisco-domestic-violence-lawyer/\">San Francisco domestic violence lawyer</a>\n            </p>\n            <p>\n              <a href=\"https://www.summitdefense.com/firm-locations/san-jose/san-jose-domestic-violence-lawyer/\">San Jose domestic violence lawyer</a>\n            </p>\n            <h2>‍</h2>\n          "},"iframe":{}}