{"img":{"in8782bbc":{"src":"/assets/images/polygon-6.png","alt":"","sizes":""},"ic8a39f4":{"src":"/assets/images/image.jpg","alt":"","srcset":["/assets/images/image-p-500.jpeg 500w","/assets/images/image.jpg 694w"],"sizes":"(max-width: 767px) 90vw, (max-width: 991px) 87vw, (max-width: 1279px) 85vw, (max-width: 1439px) 83vw, (max-width: 1919px) 1087px, 1460px"},"i4b82d9af":{"src":"/assets/images/group-228-1.png","alt":"","sizes":""},"i44aed6a1":{"src":"/assets/images/james-riley.png","alt":"","sizes":""},"in720e482e":{"src":"/assets/images/rabin-nabizadeh.png","alt":"","sizes":""},"in577ddfb4":{"src":"/assets/images/deepti-sethi.png","alt":"","sizes":""},"i363314be":{"src":"/assets/images/mario-andrews.png","alt":"","sizes":""},"i5d8a7883":{"src":"/assets/images/collin-moore_1.jpg","alt":"","sizes":""},"i68e6c9de":{"src":"/assets/images/alison-minet-adams_1.jpg","alt":"","sizes":""},"in4ae33f3d":{"src":"/assets/images/scott-mossman.jpg","alt":"","srcset":["/assets/images/scott-mossman-p-500.jpeg 500w","/assets/images/scott-mossman.jpg 791w"],"sizes":"(max-width: 479px) 100vw, (max-width: 767px) 69vw, (max-width: 991px) 63vw, (max-width: 1279px) 70vw, (max-width: 1439px) 68vw, (max-width: 1919px) 238.34375px, 313.375px"},"in201afa1a":{"src":"/assets/images/61705fe3535ec88ed760fc01_patricia-campi.jpg","alt":"","sizes":""},"in351de9e8":{"src":"/assets/images/61705fe3535ec8161860fbd6_james-riley.jpg","alt":"","sizes":""},"i7471868b":{"src":"/assets/images/61705fe3535ec836f960fc14_61281f05def461c9a73b947a_ross-pytlik.jpg","alt":"","sizes":""},"in4aab3675":{"src":"/assets/images/image-48.png","alt":"","srcset":["/assets/images/image-48-p-500.png 500w","/assets/images/image-48.png 652w"],"sizes":"100vw"},"i969ffa0":{"src":"/assets/images/arrow-left.png","alt":"","sizes":""},"i519f0e04":{"src":"/assets/images/arrow-left-1.png","alt":"","sizes":""},"in319d2851":{"src":"/assets/images/left-quote-1.png","alt":"","sizes":""},"in44644d3c":{"src":"/assets/images/line-divider-pink.png","alt":"","srcset":["/assets/images/line-divider-pink-p-500.png 500w","/assets/images/line-divider-pink-p-800.png 800w","/assets/images/line-divider-pink.png 1028w"],"sizes":"100vw"},"i58ef95f2":{"src":"/assets/images/press-marin-independt-journal.jpg","alt":"","sizes":""},"in354a3ec2":{"src":"/assets/images/press-nbc.jpg","alt":"","sizes":""},"in62097254":{"src":"/assets/images/press-themercurynews.jpg","alt":"","sizes":""},"in65860303":{"src":"/assets/images/press-kron4.jpg","alt":"","sizes":""},"in1d424a2b":{"src":"/assets/images/press-dailyjournal.jpg","alt":"","sizes":""},"i3adad4de":{"src":"/assets/images/press-fox.jpg","alt":"","sizes":""},"in22c0251a":{"src":"/assets/images/press-appeal.jpg","alt":"","sizes":""},"in1d8f2f9e":{"src":"/assets/images/press-pleasanton.jpg","alt":"","sizes":""},"in24fb7c7e":{"src":"/assets/images/left-blue-arrow-slider.svg","alt":"","sizes":""},"inf3aece3":{"src":"/assets/images/blue-right-slider-arrow.svg","alt":"","sizes":""}},"link":{"a24220a4d":"tel:(408)333-9622","a77f0b049":"https://www.google.com/maps/dir//Summit+Defense,+2570+North+1st+Street+Second+Floor,+San+Jose,+CA+95131/@37.3837136,-122.0058958,12z/data=!4m8!4m7!1m0!1m5!1m1!1s0x808fcbdfbd640229:0x9b16a103d209bfbc!2m2!1d-121.924981!2d37.385185","a23":"#","a-6a86123a":"attorneys/james-reilly","a106dee0a":"mailto:office@summitdefense.com","a-40258945":"https://www.summitdefense.com/press/"},"text":{"t3b794147":"If you’ve been accused of a misdemeanor or a serious felony in the San Jose or Silicon Valley Area, a criminal defense attorney can help. At Summit Defense, our goal is always the complete dismissal of all charges. If this isn’t possible, we often negotiate solutions for our clients that allow them to avoid jail and sometimes even prosecution.","t2cdae73":"SAN JOSE CA LAW OFFICE","tn122acbc6":"Phone : (408) 333-9622","tn4c7debf2":"DRIVING LOCATION","t2268ff":"Home","tn47f97b12":"\n            <a href=\"/\" class=\"breadcrumb-links\" data-text=\"t2268ff\">Home</a> » <a href=\"firm-locations\" class=\"breadcrumb-links\">Locations </a>» San Jose\n          ","tn2d478f5e":"Locations ","t147f322b":"MORE FREQUENTLY ASKED QUESTIONS","t3f6859be":"HOW TO PAY FOR A CRIMINAL DEFENSE LAWYER","tn2a5ab2af":"You can pay a San Jose criminal defense attorney via hourly billing, case billing, or a retainer fee.","t59122f23":"IF I INTEND TO PLEAD GUILTY, SHOULD I STILL HIRE A LAWYER?","t88e2b7a":"You should always speak with a criminal law firm prior to representing yourself because it is possible to represent yourself for simple/minor charges. It’s important to understand that you may not understand the complexity of your situation and that your freedom is on the line. Knowing your rights and what a defense attorney can do for you is huge, even for misdemeanors. Felonies are always too serious to represent yourself.","tnbc30c38":"HOW IMPORTANT IS EXPERIENCE FOR A CRIMINAL DEFENSE ATTORNEY?","tn460bd3c":"It’s always crucial to hire an experienced lawyer because you don’t want to work with anyone that’s still learning on the job. Practice certainly makes perfect when it comes to criminal law, and you should always find a criminal defense firm that has many years of experience working within Santa Clara County.","t6add355f":"CAN I GET MY CHARGE DISMISSED?","t1a9d993b":"Yes, it is possible within a whole variety of ways to have your criminal charge dismissed. Some common ways that criminal charges are dismissed are through conditional/diversion discharges, exclusion of witnesses/depositions, exclusion of evidence/suppressions, evidentiary issues, affirmative defenses, and plea negotiations.","tn484fcc91":"CAN I HAVE MY CASE CLEARED FROM MY RECORD?","t5635bc24":"Clearing a criminal record","tn1c4007ca":"\n                      <a href=\"https://www.legalmatch.com/law-library/article/how-to-clear-a-criminal-record.html\" target=\"_blank\" data-text=\"t5635bc24\">Clearing a criminal record</a> is of course a lot easier said than done, but there are ways that you can clear your record of criminal charges. You can sometimes pay mandatory fines or undergo a rehabilitation program to clear your record. Not every crime can be cleared from your criminal record, and the more serious the offense the less likely you’ll be able to obtain clearance.\n                    ","t59f1318":"WILL MY PROFESSIONAL LICENSE BE SUSPENDED (i.e. MEDICAL, REAL ESTATE, etc.)","tn7f225172":"It is possible to lose your professional license when you’ve been charged with certain criminal offenses, and this is especially the case if you’re convicted.","tn5231357d":"WILL THE PUBLIC BE ABLE TO SEE THAT I WAS ARRESTED?","t5acf9daf":"Yes, your arrest record will be within a public record in the state of California.","tn75954ebb":"WILL THIS CRIME GO ON MY RECORD?","tn1d449315":"Your criminal record is a comprehensive overview of your personal criminal history, so your record will list all non-expunged criminal charges and convictions.","tn2ad9ffbe":"CAN I GET THE CHARGES REDUCED?","tn9256acb":"Absolutely, there are many ways in which our criminal law specialists will help you reduce your charges. We’ll do what is possible to have your charges dismissed or dropped, or we’ll get your charges reduced via a plea bargain.","tn371daa2c":"DRIVING DIRECTIONS TO OUR SAN JOSE CRIMINAL LAW OFFICE","tn34396c5c":"From North (River Oaks)","t71c09431":"From River Oaks, get into River Oak Pkwy going South-West. Follow this road, passing Villagio, Epic Apartment Homes, and Hobee’s as you go. This will turn into E Plumeria Dr. Follow for two blocks until you reach Zanker Rd., then take a left. On Component Dr., take a left. Our Office will be on your right, next to Specialties Café &amp; Bakery.","t477e2f32":"From East (Berryessa)","t6af17a57":"Get on Murphy Ave driving West. This will turn into E Brokaw Rd. just as you pass City Sports Club and Sprouts Farmer’s Market. Continue West on Brokaw, passing over Coyote Creek and underneath I-880. Once you reach Pacific Bay Recycling Center and Porcelanosa San Josa, take a right onto Zaker Rd. Follow Zanker for just under a mile, until you reach Component Dr. Take a left on Component, and our office will be on your right, right next to LG Display America.","tn4528a43b":"From South (Downtown San Jose)","tn4e3a8ba9":"From Downtown San Jose, hop on CA-87 N heading to North San Jose. Continue North, passing Guadalupe Park, Columbus Park, and Norman Y. Mineta San Jose Intl. Airport. Take exit 9A toward N 1st St. Once you see PayPal Headquarters, take a left onto N 1st St. Follow N 1st St., once you see Ebay’s headquarters on your left, our office is on the right side of the street.","tn553f7f1e":"From West (Santa Clara)","t4a78177d":"Start by heading North on Scott Blvd. Follow Scott for 1.3 miles. Once you see NVIDIA on your left and Owen’s Corning on your right, turn right onto Central Expy. Once you reach the airport, take a left onto W Trimble Road. Pass under Highway 101 and over the Guadalupe River, passing Lumileds on your right. Take a right onto Orchard Pkwy, then a quick left onto Component Dr. Our office is on your left after Ebay.","tn6f77f3bf":"COURTS THAT HANDLE CRIMINAL DEFENSE CASES IN SAN JOSE, CA","tn64777b3b":"191 West Hedding Street San Jose, CA 95110","tn6f8cc0b8":"01 N. First Street, San Jose, CA 95113","tn1efde40d":"JAILS IN SAN JOSE CA","tf82cd92":"The Main Jail","t1fb24280":"All inmates are initially booked through this correctional facility in Downtown San Jose.","tn7f1e4f53":"Elmwood Correctional Facility","t797628cd":"This correctional facility in Milpitas has complexes for both male and female inmates.","tn4ebb0c7c":"related links","tn54f0d84d":"Domestic Violence - San Jose ","tnfcf3a52":"DUI - San Jose ","t4bef5a12":"Sex Crime - San Jose","tn3dccae7f":"our attorneys","tn22806f52":"James Reilley","tn2bf5a469":"ATTORNEY AT LAW","t5a716f0e":"VIEW PROFILE","tn40ec3c02":"Successful Case Results in San Jose","tn642a1620":"Mortgage Fraud","tn55f974a3":"Domestic Violence","t205238d6":"Possession of Drugs for Sale","t2fa776b1":"Current San Jose Career Opportunities","t4276f3ac":"Position: Criminal Defense Attorney","tn4c9cfbf":"We are seeking an experienced attorney to work with our team in San Jose. Qualified candidate will have 5-7 years of experience working as a Criminal Defense Attorney. We are seeking an aggressive attorney with proven track record and winning trial strategies. Prefer an individual with background in District Attorney’s office. Position will require extensive felony trial work and will focus on Santa Clara courts including San Jose, Palo Alto and Morgan Hill.","t590fa8ae":"Please send a resume, cover letter, salary history as well as sample writing to: ","tn5af845fe":"office@summitdefense.com","tn31d441ca":"Summit Defense is nothing short of AMAZING, namely, Rabin N. When I caught my case, I was scared out of my mind and didn’t know what to do or what to expect, Rabin kept gave me realistic expectations but got me THEE BEST outcome imaginable. I was facing 3-5 years IN PRISON, and walked away with NO JAIL TIME!! I will forever be grateful for his knowledge and expertise!! This man KNOWS WHAT HE’S DOING and is VERY WELL CONNECTED!","t76d956d7":"San Jose","tn30d0ec6e":"After my son’s arrest, I met with several attorneys who promised miracles for very high fees. &nbsp;I ended up hiring Summit Defense right before the Preliminary Hearing in the case. &nbsp;If you are looking for honest and skilled lawyers, choose Summit Defense. &nbsp;Despite several mistakes by my first lawyer, Mr. Weese was able to correct the record and get us the best results at a reasonable price.","tcc1ec3d":"Los Altos","tn328f976a":"Thank you Mr. Riley for not giving up and saving our family from ruin. &nbsp;I can’t imagine where I would be if it weren’t for your diligence and amazing talent. &nbsp;You are truly one of a kind Mr. Riley and I will be greatful for you for the rest of my life.","tn6ac7430d":"The attorneys at this firm are amazing! &nbsp;It &nbsp;took two years to resolve my case and through out everyone was amazing. &nbsp;Special mention for Jessica, the paralegal who worked tirelessly with me to deliver all the documents needed and was probably my best friend for the entire time.","t34c54f4e":"Amazing lawyer and just a kind, no bullshit human being. &nbsp;Told me what could be done and did it for half the price and ridiculous promises other attorneys delivered.","tn714fbfb4":"Thank you for everything. &nbsp;Your empathy, diligence and for not giving up. &nbsp;Highly recommend if you get a DUI.","tna4cc944":"I have known many lawyers in my day and these guys are top guns. Richard Weise was professional and &nbsp;really went to bat for our whole family. &nbsp;Highly recommend if you need a criminal lawyer.","t9c4ae4a":"Can’t express how pleased with Tennille Duffy. &nbsp;She is the most talented attorney I have seen and challenged every detail and never backed down. ","tn72b44deb":"Forever grateful to whole team of attorneys for doing an outstanding job on a DUI case. Very responsive and talented. Richard is an exceptional lawyer and I would highly recommend him to anyone seeking a criminal lawyer.","t156c7a6c":"SUMMIT DEFENSE IN THE PRESS","t690e201f":"READ&nbsp;MORE"},"textarea":{"tan546d94a5":"<br>San Jose Criminal Defense Attorney<br>‍","ta2e1ee8cb":"<strong class=\"bold-text-18\">Summit Defense</strong><br>2570 North 1st Street , Second Floor San Jose, CA 95131","tan470b1a0":"<strong class=\"bold-text-22\">We’re open 24 Hours. </strong><br>For additional questions you can call us at (408) 333-9622","tab64598b":"Hall of Justice <br>(HOJ)","ta2ce2b663":"<strong>Cases Handled:</strong> If you are accused of committing any criminal offense in San Jose, your case will likely be handled at the Hall of Justice.","tan201f094f":"Phone:<br>‍<a href=\"tel:(408)808-6600\" class=\"link-9\">(408) 808-6600</a>\n                ","tan11a4b84a":"Family Justice Center<br>Courthouse (FJCC)","ta71d46310":"<strong>Cases Handled: </strong>Drug charges<br><strong>Criminal Court Calendar : </strong>Santa Clara Country","ta1e618fcb":"Phone: <br>‍<a href=\"tel:(408)792-4200\" class=\"link-9\">(408) 792-4200</a>\n                ","ta69eac49e":"<strong>RABIN NABIZADEH</strong>","tan3f26c3bc":"<strong>DEEPTI SETHI</strong>","tan3f920eb6":"<strong>MARIO ANDREWS</strong><br>","ta78891611":"<strong>COLLIN MOORE</strong>","tan2619c2c7":"<strong>ALISON MINET ADAMS</strong><br>","tan75f91de9":"<strong>SCOTT MOSSMAN</strong><br>","ta1b0e4569":"<strong>PATRICIA CAMPI</strong><br>","ta1c9048d5":"<strong>TENNILLE DUFFY</strong><br>","tan18ab0ba":"<strong>ROSS PYTLIK</strong><br>","ta42452619":"<strong>Client</strong> <strong>:</strong> Beth R<br><strong>Location :</strong> San Jose<br><strong>Attorney : </strong>Richard Weese, Jim Riley<br><br>Client was charged with mortgage fraud in federal court and the matter proceeded to trial in federal court in San Jose.<br>‍<br><strong>Result</strong> : <em>First Not Guilty finding in Judge’s court for over 25 years.</em>","ta3526f3d7":"<strong>Client</strong> <strong>:</strong> Raji M.<br><strong>Location :</strong> San Jose<br><strong>Attorney : </strong>Tennille Duffy<br>‍<br>Client was charged with domestic violence and criminal threats against his wife. Client also appeared to suffer from a drug addiction that made his representation quite difficult (several missed court appearances).<br>‍<br><strong>Result</strong> : <strong><em> </em></strong><em>Case dismissed by District Attorney three days into trial after only about a day into our cross examination.</em>","ta20":"<em> </em>","ta3f04d617":"<strong>Client</strong> <strong>:</strong> Nathan G.<br><strong>Location :</strong> San Jose<br><strong>Attorneys : </strong>Richard Weese and Rabin Nabizadeh<br><br>Officers found scales, payout sheets and large sums of cash in the car.<br>‍<br>‍<strong>Result</strong> : <em>After numerous attempts case was reduced from felony sales to misdemeanor possession and deferred entry of judgment leading to dismissal.</em>","tan4febd617":"Client <span class=\"header-spanv\">Testimonials</span>","ta1b11ee9a":"Real People. <span class=\"header-spanv\">Real Stories.</span>","ta221b69ca":"<strong>Michelle C.</strong>","tan62caac0c":"<strong>Sunny c.</strong>","ta330312db":"<strong>Marcus P.</strong>","ta76d956d7":"San Jose<br>","tan113e5883":"<strong>Timothy C.</strong>","ta2aca69af":"<strong>Ginger W.</strong>","ta1f3af962":"<strong>Tony F.</strong>","ta55241b1a":"<strong>Connie L.</strong>","tan187b401d":"<strong>Athena H.</strong>","tan705928a":"<strong>Sophie H.</strong>"},"richtext":{"rn66fdde0":"\n              <p>Summit Defense has over 120 cumulative years of criminal defense experience, so you can count on <a href=\"https://www.summitdefense.com/attorneys/\" target=\"_blank\">our attorneys</a> to support you when you’re facing criminal charges and the stakes are high.</p>\n              <p>We take a lot of pride in being your San Jose criminal defense attorney, and being one of the top criminal law offices in San Jose CA. We’re confident that our legal advice and overall expertise as a criminal defense lawyer will put you and your criminal charges in the very best position for a favorable outcome.</p>\n              <p>Our <a href=\"https://www.summitdefense.com/case-results/\" target=\"_blank\">case results</a> truly speak for themselves, and as your defense attorney, we’ll go above and beyond to exceed your expectations by making the most out of your unique scenario within state and federal courts.</p>\n              <p>Below we’ll be providing a comprehensive overview oriented around criminal law and the criminal justice system, and as always feel free to <a href=\"https://www.summitdefense.com/contact/\" target=\"_blank\">contact us online</a> or call us at <a href=\"tel:4083339622\" target=\"_blank\">(408) 333-9622</a> to speak directly with experienced criminal defense attorneys during your free consultation.</p>\n              <h3>HOW TO FIND THE BEST SAN JOSE CRIMINAL DEFENSE ATTORNEY?</h3>\n              <p>There’s no denying that criminal charges of all kinds are serious and stressful legal situations, and <a href=\"https://www.summitdefense.com/choosing-defense-lawyer/\" target=\"_blank\">choosing the right criminal defense lawyer</a> for your criminal case is also a lot easier said than done. There are many San Jose criminal attorneys out there to choose from, but you should know that your lawyers have experience in handling crimes similar to yours and also have good relationships with prosecutors in San Jose California.</p>\n              <p>Here are some tips to keep in mind as you’re trying to find the best criminal defense lawyers in Santa Clara County:</p>\n              <ul role=\"list\">\n                <li>Your lawyer should be very responsive</li>\n                <li>The right attorney will specialize within criminal law</li>\n                <li>Choose a law office that has experience within San Jose local courts (knows local prosecutors/are former prosecutors)</li>\n                <li>Check reputable sources to verify the law firm’s expertise within defense law</li>\n                <li>Ask for referrals from past clients who faced similar legal issues as you</li>\n                <li>Top-rated San Jose CA attorneys will fully understand the law basics and will be able to thoroughly explain your charges to you</li>\n                <li>Make sure your attorney provides a clear payment plan</li>\n                <li>Try to gauge the attorney’s overall enthusiasm</li>\n                <li>Make sure they’re experienced as a<a href=\"https://www.merriam-webster.com/dictionary/trial%20lawyer\" target=\"_blank\"> trial attorney</a>\n                </li>\n              </ul>\n              <p>When it comes down to it, finding the best San Jose criminal defense lawyer will require trusting your instincts. Our law firm has all the experience you’ll need to obtain your most favorable outcome, and we highly value customer care and satisfaction with all of the charges we defend.</p>\n              <h3>WHEN TO HIRE A CRIMINAL DEFENSE LAWYER?</h3>\n              <p>There are countless situations in which an individual will need to hire a criminal defense lawyer. Summit Defense has the experience and connections in the San Jose criminal justice system to provide you or your loved one with a comprehensive strategy.</p>\n              <p>Many lawyers throughout California will say they’re a part of a top-rated law firm without being able to fully back it up, you can get a good glimpse into our past success by simply reading our <a href=\"https://www.summitdefense.com/reviews/\" target=\"_blank\">reviews</a>.</p>\n              <p>The following are some of the most common <a href=\"https://www.summitdefense.com/crimes-we-defend/\" target=\"_blank\">crimes we defend</a>, which are criminal charges that will require the assistance of an experienced criminal defense attorney:</p>\n              <ul role=\"list\">\n                <li>Violent crimes</li>\n                <li>Drug crimes</li>\n                <li>\n                  <a href=\"https://www.law.cornell.edu/wex/white-collar_crime#:~:text=The%20following%20is%20an%20inclusive,institution%20fraud%2C%20government%20fraud%2C%20healthcare\" target=\"_blank\">White collar crimes</a>\n                </li>\n                <li>Murder cases</li>\n                <li>Misdemeanors</li>\n                <li>Felony charges</li>\n                <li>Rape charges</li>\n                <li>DUI/DWI</li>\n                <li>Assaults</li>\n                <li>Embezzlement</li>\n                <li>Grand theft</li>\n                <li>And much more…</li>\n              </ul>\n              <p>You’re essentially going to need a criminal defense lawyer when you’re facing any kind of criminal related charges, and working with an experienced law firm like Summit Defense that has decades of experience defending all sorts of charges will put you and your legal standing in the best situation for your most favorable outcome.</p>\n              <h3>WHAT DOES A CRIMINAL LAWYER DO?</h3>\n              <p>It’s important to understand what our San Jose CA attorneys will actually do for you or your loved one throughout the entirety of your legal proceedings. The Summit Defense law offices have supported countless unique cases, so we know the differences and similarities throughout all criminal law scenarios.</p>\n              <p>Although everyone’s criminal charges are unique, it’s still safe to say that a criminal lawyer will do the following for you no matter what charges you’re currently facing:</p>\n              <ul role=\"list\">\n                <li><strong>Case Evaluation:</strong> when you reach out to us for a free consultation, our San Jose criminal defense lawyers will get as many details about your unique legal situation as possible. We’ll ask very specific questions so we can learn what your case’s strengths and weaknesses are, and this crucial information will dictate your best course for legal action.</li>\n                <li><strong>Case Investigation:</strong> After we’ve conducted our thorough case evaluation, our team will then conduct a comprehensive investigation into your case. This investigation will be aimed at discovering specific avenues of acquittal. We will often interrogate police officers, eyewitnesses, expert witnesses, and anyone else that has important information about your case. This investigation process will go a long way towards developing a strong defense. We’ll also review the prosecution’s case to find holes in their case and further our evidence-gathering strategies.</li>\n                <li><strong>Evidence Analysis:</strong> This is where your defense attorney and their law offices will carefully study all of the facts and theories that apply to your case.</li>\n                <li><strong>Continued Client Contact:</strong> It’s important to note that you’ll be kept in the loop throughout every step of these processes, so you’ll know when certain developments arise and how your course for legal action expands. Communication is key to all of us at Summit Defense because we know just how important these services are for you and your future.</li>\n                <li><strong>Jury Selection:</strong> Your San Jose criminal defense lawyer will be integral during jury selection because removing specifically biased jurors will provide defendants with a better likelihood of acquittal.</li>\n                <li><strong>Plea Bargaining:</strong> Negotiating with prosecutors within plea bargain scenarios is one of the most important duties of a criminal defense attorney, because securing a favorable deal is nearly impossible when representing yourself.</li>\n                <li><strong>Trial Participation: </strong>Our legal team will fight for you during a trial with all of our experience and knowledge at your disposal. This will include examining witnesses, cross-examining the prosecution’s witnesses, and ultimately convincing the jury of your innocence or the prosecution’s failure to meet a sufficient burden of proof.</li>\n                <li><strong>Sentencing:</strong> If a client of ours is in fact sentenced to a crime or accepts a plea bargain, then it’ll be our job to represent you during the sentencing negotiations. We’ll help limit the amount of incarceration time or help you obtain alternatives to incarceration.</li>\n              </ul>\n              <h3>HOW MUCH DOES A SAN JOSE CRIMINAL ATTORNEY COST?</h3>\n              <p>The overall costs of hiring a criminal defense attorney will largely depend upon the complexity of your unique case, your attorney’s overall experience, and where you’re located.</p>\n              <p>The three main payment options for a criminal law specialist are:</p>\n              <ul role=\"list\">\n                <li>Hourly billing</li>\n                <li>Case billing</li>\n                <li>Retainer fees</li>\n              </ul>\n              <p>Each of these payment plans will have its pros and cons, and you can learn more about paying a defense attorney <a href=\"https://www.nolo.com/legal-encyclopedia/paying-private-criminal-defense-attorney.html\" target=\"_blank\">here</a>.</p>\n              <h3>WHAT IF I CAN’T AFFORD TO HIRE A SAN JOSE DEFENSE ATTORNEY?</h3>\n              <p>A Santa Clara County Public Defender is an affordable option for you if you feel as though you can’t afford a private defense attorney. San Jose CA just so happens to have great public defenders, however, this option is typically only available to indigent individuals.</p>\n              <h3>SAN JOSE CRIMES WE DEFEND:</h3>\n              <ul role=\"list\">\n                <li>\n                  <a href=\"https://www.summitdefense.com/violent-crimes/assault/\" target=\"_blank\">Assaults</a>\n                </li>\n                <li>Deadly weapon assaults</li>\n                <li>Battery of police officer</li>\n                <li>Battery that causes bodily injuries</li>\n                <li>\n                  <a href=\"https://www.summitdefense.com/sex-crimes/child-pornography/\" target=\"_blank\">Child pornography</a>\n                </li>\n                <li>\n                  <a href=\"https://www.summitdefense.com/sex-crimes/child-molestation/\" target=\"_blank\">Child molestation</a>\n                </li>\n                <li>Drug crimes</li>\n                <li>\n                  <a href=\"https://www.summitdefense.com/firm-locations/san-jose/san-jose-domestic-violence-lawyer/\" target=\"_blank\"> Domestic violence</a>\n                </li>\n                <li>\n                  <a href=\"https://www.summitdefense.com/san-jose-dui-lawyer/\" target=\"_blank\">DWI/DUI</a>\n                </li>\n                <li>Expungement</li>\n                <li>Embezzlement</li>\n                <li>Grand theft</li>\n                <li>Federal cases</li>\n                <li>Marijuana law</li>\n                <li>Indecent exposure</li>\n                <li>Hit and run</li>\n                <li>Other types of sex offenses</li>\n                <li>Shoplifting/Petty theft</li>\n                <li>Small business and professional licensing</li>\n                <li>Prostitution</li>\n                <li>Probation violation</li>\n                <li>Rape</li>\n                <li>Resisting arrest</li>\n                <li>Registration of sex offenders</li>\n                <li>Solicitation</li>\n                <li>Statutory rape</li>\n                <li>\n                  <a href=\"https://www.summitdefense.com/sex-crimes/\" target=\"_blank\">Sex crimes</a>\n                </li>\n                <li>And many more…</li>\n              </ul>\n            ","rn31470275":"\n              <h3>CALIFORNIA CRIMINAL COURT PROCESS</h3>\n              <p>The court process within California is like many other states, but it will have its own unique qualities. When you’re arrested and booked, you’ll likely have the opportunity to obtain bail and be released from jail. When you hire Summit Defense as your private defense attorney, you may be able to skip some later court appearances as we’ll represent you.</p>\n              <p><strong>Arraignment Hearing:</strong></p>\n              <p>You’ll then go through an <a href=\"https://www.criminaldefenselawyer.com/resources/criminal-defense/criminal-defense-case/criminal-arraignment-what-expect\" target=\"_blank\">arraignment hearing</a>, and this is where your defense lawyer and prosecutors will try to reach a resolution without needing to go to trial. The San Jose District Attorney may decide to dismiss your case or reduce charges through a plea agreement during your arraignment, depending upon the strength of their case.</p>\n              <p><strong>Preliminary Hearing:</strong></p>\n              <p>Those charged with felonies will be entitled to a <a href=\"https://www.justice.gov/usao/justice-101/preliminary-hearing\" target=\"_blank\">preliminary hearing</a>, and the purpose of this hearing is to give the prosecutors an opportunity to present their case to the California court and show that they in fact have a substantial amount of evidence to press charges against you. The burden of proof is low in preliminary hearings because they only have to prove the probable cause of the defendant’s guilt, so it is common for prosecutors to win these cases. However, if our defense lawyers win your preliminary case, then your charges are dismissed.</p>\n              <p>If you do end up getting convicted of a crime, you’ll then have a sentence imposed upon you by a judge. There are many instances in which a judge will grant probation instead of jail time, and our legal specialists will ensure that your sentence is as favorable as possible if this situation arises.</p>\n              <h3>CALIFORNIA VIOLENT CRIME CHARGES</h3>\n              <p>\n                <a href=\"https://www.cdcr.ca.gov/parole/violent-offenses-defined/\" target=\"_blank\">The definition of violent offenses in California</a> is undoubtedly complex, and <a href=\"https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?sectionNum=667.5.&amp;lawCode=PEN\" target=\"_blank\">Penal Code 667.5</a> provides detailed information about violent crimes in Santa Clara County and California. Some example of violent felonies in California include:\n              </p>\n              <ul role=\"list\">\n                <li>Murder</li>\n                <li>Voluntary manslaughter</li>\n                <li>Rape</li>\n                <li>Mayhem</li>\n                <li>Oral copulation</li>\n                <li>Sodomy</li>\n                <li>Lewd acts on a child under 14 years old</li>\n                <li>Robbery</li>\n                <li>Felonies that inflict bodily injury</li>\n                <li>Arson</li>\n                <li>Attempted murder</li>\n                <li>Kidnapping</li>\n                <li>Assault with intent to commit a felony</li>\n                <li>Carjacking</li>\n                <li>Extortion</li>\n                <li>And much more…</li>\n              </ul>\n              <h3>CALIFORNIA SEX CRIMES DEFENSE CHARGES</h3>\n              <p>\n                <a href=\"https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=PEN&amp;sectionNum=243.4.#:~:text=(a)%20Any%20person%20who%20touches,is%20guilty%20of%20sexual%20battery.\" target=\"_blank\">Penal Code 243.4</a> dictates certain sexual crimes in California, and some charges associated with this code include sexual battery and all of its subsequent criminal associations.\n              </p>\n              <h3>CALIFORNIA DUI CRIME CHARGES</h3>\n              <p>\n                <a href=\"https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=VEH&amp;sectionNum=23152.\" target=\"_blank\">Penal Code 23152</a> prohibits anyone driving a motor vehicle under the influence of alcohol or drugs, and this law is much broader than most people would probably assume. Our San Jose criminal defense law firm will help you defend yourself against these complex criminal charges.\n              </p>\n              <h3>CONTACT A SAN JOSE CRIMINAL DEFENSE LAWYER</h3>\n              <p>The criminal defense attorneys at <a href=\"https://www.summitdefense.com/\" target=\"_blank\">Summit Defense</a> have supported countless people throughout San Jose, Santa Clara County, and all of Northern California when it comes to defending criminal charges of all types. Our San Jose criminal defense attorneys are some of the best in the entire region, which is why we’re a top-rated defense law firm in the San Jose area.</p>\n              <p>\n                <a href=\"https://www.summitdefense.com/contact/\" target=\"_blank\">Reach out to us online</a> or call us at &nbsp;<a href=\"tel:4083339622\" target=\"_blank\">(408) 333-9622</a> to get in touch with our law offices and schedule your free consultation today.\n              </p>\n            "},"iframe":{"i186935c5":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d50733.532620220954!2d-121.93973395457546!3d37.36982564301237!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x808fcbdfbd640229%3A0x9b16a103d209bfbc!2sSummit+Defense+Attorneys+%E2%80%93+San+Jose!5e0!3m2!1sen!2shr!4v1475315454830"}}