{"img":{"i45a466cb":{"src":"/assets/images/avvo-logo.png","alt":"","sizes":""},"i17bbe27e":{"src":"/assets/images/super-lawyers.png","alt":"","sizes":""},"i7cadd801":{"src":"/assets/images/bar-register_1bar-register.png","alt":"","sizes":""},"i13beeee5":{"src":"/assets/images/yelp.png","alt":"","sizes":""},"i6277d003":{"src":"/assets/images/nal_1nal.png","alt":"","sizes":""},"in1334f7a7":{"src":"/assets/images/dwi_lawyers-oakland-2021-clr_1dwi_lawyers-oakland-2021-clr.png","alt":"","sizes":""},"in744234bd":{"src":"/assets/images/cdl_1cdl.png","alt":"","sizes":""}},"link":{},"text":{"t2268ff":"Home","tn665ddcfa":"\n            <a href=\"/\" class=\"breadcrumb-links\" data-text=\"t2268ff\">Home</a> » Choosing a Bay Area Defense Lawyer\n          "},"textarea":{"tan5d6f381a":"CHOOSING A BAY AREA <br>DEFENSE LAWYER"},"richtext":{"rn7c664691":"\n              <h1>Bay Area Criminal Defense Lawyers</h1>\n              <p>Summit Defense Criminal Defense Lawyers Bay Area – An Exclusively Criminal Defense Firm – Offices in San Jose, San Francisco, Oakland, Redwood City and San Rafael</p>\n              <p>Summit Defense only represents individuals charged with or accused of a crime. Our philosophy is simple—it is best to practice in one area of law. We do not specialize in <a href=\"https://www.summitdefense.com/firm-locations/san-francisco/\">criminal law</a>—<strong><em>it’s all we do</em></strong>. Nearly every day Summit Defense attorneys are in Bay Area courtrooms fighting for client’s freedom, insisting on the presumption of innocence, and taking police and prosecutors to task when they violate your rights.</p>\n              <p>We’re not interested in divorce or dog bite cases. Our focus gives us a depth of experience and expertise that often means the difference between freedom and jail for our clients. Nothing is more rewarding than keeping an individual out of jail or preserving a person’s reputation and clean record. We will always be exclusively devoted to defending individuals against state and federal criminal charges. We believe that by focusing on criminal defense exclusively, we’re best able to serve our clients. Perhaps that is why many non criminal attorneys often refer their criminal cases to Summit Defense.</p>\n              <h3>Attorneys Working Together</h3>\n              <p>Two heads are better than one. Whether you’re charged with shoplifting or a much more serious felony, it’s critical that everything possible is done on your behalf. &nbsp;Our Bay Area <a href=\"https://www.summitdefense.com/firm-locations/san-jose/\">criminal defense attorneys</a> always work together. We all bring unique backgrounds, education, and local knowledge to the table. Our clients benefit from this <a href=\"https://www.summitdefense.com/choosing-defense-lawyer/team-approach/\">team approach</a> every day.</p>\n              <figure style=\"padding-bottom:56.25%\" class=\"w-richtext-align-fullwidth w-richtext-figure-type-video\">\n                <div><iframe src=\"https://www.youtube.com/embed/xLI5az5toGs?feature=oembed\" frameborder=\"0\" allowfullscreen=\"\"></iframe></div>\n              </figure>\n              <p>‍</p>\n              <p>For example, a Summit Defense client facing a fraud investigation in San Jose would be well served by Collin Moore’s extensive labor law expertise, Mr. Andrew’s law enforcement background, and Ryan McHugh’s local knowledge of San Jose courts and prosecutors. By working together, we can be more responsive to our clients who then get the benefit of several lawyers’ experience.</p>\n              <p><em>None of us know everything</em>. By working together and sharing successful strategies and knowledge of judges and prosecutors, our clients receive the most thorough and resourceful representation possible.</p>\n              <h3>Local Knowledge—Know Your Opponent</h3>\n              <p>Summit <a href=\"https://www.summitdefense.com/firm-locations/oakland/\">Defense Criminal Attorneys</a> know Bay Area courts, investigators, prosecutors, programs, bail bondmen, expert witnesses….and we are known and respected by the legal community. Our attorneys include a former police officer and three former district attorneys. They have received awards and honors throughout the Bay Area. Our Senior Trial Attorney, James T. Reilly was even honored in the courtroom <em>on the record</em> by a San Jose Superior Court judge. (<a href=\"https://www.summitdefense.com/attorneys/james-reilly/\">see James Reilly’s bio</a>).</p>\n              <p>This local knowledge is more than just a familiarity with a particular court. It means understanding that some strategies may be effective in San Francisco but less so in San Jose or Redwood City. It includes the ability to educate a new prosecutor about a first time offender’s program that might be appropriate for a Summit Defense client. By fighting cases throughout the Bay Area and Northern California, Summit Defense attorneys have the advantage of local knowledge without the limitations of a firm whose experience is limited to one city or county.</p>\n              <h3>Hired by the People Who Know</h3>\n              <p>Nothing speaks more of our standing as criminal defense lawyers than our caliber of clients. We have represented a wide range of people charged with criminal offenses, including police officers, CEOs of companies, other attorneys and prominent members of the community. We are also proud that most of our clients come to us by referrals from other attorneys.</p>\n              <h3>Award Winning Customer Service</h3>\n              <p>Choosing the attorney that will represent you is one of the most important decisions that you will make. When you hire your attorney, you should look for someone who both excels in the courtroom and also carefully listens to your concerns. Academic credentials are important, but so are the abilities to listen to the client’s needs and to be responsive. Summit Defense believes that their clients should expect and demand a law firm that provides superb customer service.</p>\n              <p>Summit Defense is proud to have been awarded the <strong>highest possible rating for customer service</strong> by the Better Business Bureau. Summit Defense has received an “A+” for the past 6 years.</p>\n            "},"iframe":{}}
