{"img":{"in8782bbc":{"src":"/assets/images/polygon-6.png","alt":"","sizes":""},"ic8a39f4":{"src":"/assets/images/image.jpg","alt":"","srcset":["/assets/images/image-p-500.jpeg 500w","/assets/images/image.jpg 694w"],"sizes":"(max-width: 767px) 90vw, (max-width: 991px) 87vw, (max-width: 1279px) 85vw, (max-width: 1439px) 83vw, (max-width: 1919px) 1087px, 1460px"},"i4b82d9af":{"src":"/assets/images/group-228-1.png","alt":"","sizes":""},"i969ffa0":{"src":"/assets/images/arrow-left.png","alt":"","sizes":""},"i519f0e04":{"src":"/assets/images/arrow-left-1.png","alt":"","sizes":""},"in319d2851":{"src":"/assets/images/left-quote-1.png","alt":"","sizes":""},"in44644d3c":{"src":"/assets/images/line-divider-pink.png","alt":"","srcset":["/assets/images/line-divider-pink-p-500.png 500w","/assets/images/line-divider-pink-p-800.png 800w","/assets/images/line-divider-pink.png 1028w"],"sizes":"100vw"},"i58ef95f2":{"src":"/assets/images/press-marin-independt-journal.jpg","alt":"","sizes":""},"in354a3ec2":{"src":"/assets/images/press-nbc.jpg","alt":"","sizes":""},"in62097254":{"src":"/assets/images/press-themercurynews.jpg","alt":"","sizes":""},"in65860303":{"src":"/assets/images/press-kron4.jpg","alt":"","sizes":""},"in1d424a2b":{"src":"/assets/images/press-dailyjournal.jpg","alt":"","sizes":""},"i3adad4de":{"src":"/assets/images/press-fox.jpg","alt":"","sizes":""},"in22c0251a":{"src":"/assets/images/press-appeal.jpg","alt":"","sizes":""},"in1d8f2f9e":{"src":"/assets/images/press-pleasanton.jpg","alt":"","sizes":""},"in24fb7c7e":{"src":"/assets/images/left-blue-arrow-slider.svg","alt":"","sizes":""},"inf3aece3":{"src":"/assets/images/blue-right-slider-arrow.svg","alt":"","sizes":""}},"link":{"a56d88c51":"tel:(650)667-4141","a-1cbf60df":"https://www.google.com/maps/dir//Summit+Defense+370+Convention+Way+%23316+Redwood+City,+CA+94063/@37.49448,-122.229093,15z/data=!4m5!4m4!1m0!1m2!1m1!1s0x808fa2505c668e2f:0x1b25c944da7130e5","a23":"#","a-40258945":"https://www.summitdefense.com/press/"},"text":{"tn1b6529f5":"REDWOOD CITY CA OFFICE","te5b2144":"Phone: (650) 667-4141","t6be30b0d":"Driving Directions","t2268ff":"Home","t61c6b6b8":"\n            <a href=\"/\" class=\"breadcrumb-links\" data-text=\"t2268ff\">Home</a> » <a href=\"firm-locations\" class=\"breadcrumb-links\">Locations </a>» Redwood City\n          ","tn2d478f5e":"Locations ","t4abf36dc":"From Redwood Shores, get onto Marine Pkwy heading East. Along the way, you’ll pass Lighthouse Cove, Shorebird Park, and Redwood Shores Lagoon. Merge onto US-101, driving South for 5 miles passing San Carlos Airport and REI on the way. Take exit 409 and merge onto Veterans Blvd. Take a left onto Convention Way, after .3 miles, our office will be on your left.","t5148513c":"From Downtown Menlo Park, merge onto El Camino Real going North-West, passing Holbrook Palmer Park, Lloyden Park, and Redwood Junction along the way. At Redwood Junction, take a slight right onto Main St, following for 1.2 miles, passing In-N-Out Burger and the Redwood City DMV. Take a left onto Convention Way, and our office will be on your right.","tn5feff52":"From Edgewood Park, start driving North on Edgewood Rd, driving around Wellesley Crescent Park, then take a right onto El Camino Real at Stacks restaurant, followed by a quick left onto Whipple Ave going North-West. Pass Mezes Park and AAA Redwood City, and take a right onto Veterans Blvd. Take a quick left onto Convention Way, passing the Land Rover and Lexus Dealerships. Our office will be on your left.","tn4ebb0c7c":"related links","t63194203":"Domestic Violence - Redwood City","t2dcfb28c":"DUI Lawyer - Redwood City ","tn361205da":"Successful Case Results In Redwood City, CA","t612a4857":"Rape of an Intoxicated Person","t454610f5":"Never in a million years did I think i’d EVER need a defense attorney, but I’m am beyond grateful to have been referred to Summit defense!! This team KNOWS WHAT THEY’RE DOING and KNOW THE RIGHT PEOPLE!! Not only did they get me through this, they got me OUT OF THIS!! I was found NOT GUILTY and the case was dismissed!! Special shout out to Rabin, who knew exactly what to do to win my case!! thank you a million times over!! HIGHLY RECOMMEND if you find yourself in trouble with the law and at risk of losing your FREEDOM!!","t349f09cd":"Redwood City","tn90acc3f":"The law firm's attorney was professional, honest and understanding. &nbsp;For months, he was able to keep me posted and discussed the case with my wife who was, at this point, calling weekly. &nbsp;Results are as good as it gets. &nbsp;Highly recommend.","tn7a3329e6":"Hillsborough","tn2c32b2d4":"I highly recommend Mr. Mchugh for any criminal case you have. &nbsp;Took the time to answer all my questions and really cared about the outcome. &nbsp; He was knowledgeable and compassionate and got the job done. &nbsp;Really as good as it gets for criminal lawyers.","t3e1ff052":"Rabin Nabizadeh is my lion! &nbsp;Sitting in that cell hearing him passionately argue for bail, I was so relieved my husband hired him. &nbsp;At the end, I got a misdemeanor. &nbsp;Thank you Rabin for saving my family.","tn572e7544":"I have unfortunately used several criminal lawyers throughout the years. &nbsp;This group is probably the best lawyers in the bay area. &nbsp;Ms. Duffy explained every thing to us and when it came to court, they were a force of nature. &nbsp;Got me the deal I wanted. &nbsp;I would highly recommend them.","tn42ba4415":"I met with Mr. Nabizadeh after interviewing several attorneys. &nbsp;I could tell right away that he was comfortable and wasn’t trying to sell me anything. &nbsp;He listened to all my concerns and gave me amazing advise. &nbsp;I ended up hiring this firm and could not be more pleased with the outcome.","tn7410cc10":"I was hopeless and ashamed when my daughter was arrested. &nbsp;Having never even imagined dealing with a criminal case, I was panicked and paralyzed. &nbsp;My co worker told me about Mr. Mchugh and provided his cell phone number. &nbsp;Ryan was sympathetic honest and at the same time professional and pro active. &nbsp;My daughter has moved on to better things and we know Ryan was a big part of that.","t156c7a6c":"SUMMIT DEFENSE IN THE PRESS","t690e201f":"READ&nbsp;MORE"},"textarea":{"ta71a6fa48":"Redwood City Criminal Defense attorney<strong><br></strong>","ta3fbe8166":"<br>","ta3ac38c30":"Criminal Defense &amp; Domestic Violence Lawyers in San Mateo County<strong><br></strong>","tancdc26b9":"If you’ve been accused of a <strong>misdemeanor</strong> or a serious <strong>felony</strong> – whether in San Mateo county or elsewhere in the Bay Area – a Redwood City criminal defense attorney can help. At Summit Defense, our goal is always the <strong>complete dismissal of all charges</strong>. If this isn’t possible, we often negotiate solutions for our clients that allow them to avoid jail and sometimes even prosecution.<br>","tan305af740":"<strong class=\"bold-text-18\">Summit Defense</strong><br>370 Convention Way, Suite 316, Redwood City, CA 94063","ta1ac35e7":"Driving Directions to our Redwood City Law Office<strong><br></strong>","tan60128376":"<strong>From Redwood Shores (North)</strong><br>","tan101e7f21":"<strong>From East Palo Alto (East)</strong><br>","tan12a457ff":"From East Palo Alto, drive South on University Ave until you reach US-101 (right behind IKEA). Merge onto Highway 101 going North, passing Menlo Park Hospital, Flood Park, and Kaiser Permanente Redwood City Medical Center. Take exit 409 for Whipple Ave, driving past Boardwalk Chevrolet and Toyota 101. Take a left onto Whipple Ave, going under the highway. Take a left onto Veterans Blvd, and another left onto Convention Way. Across the street from Satellite Healthcare, our office will be on your left.<br>","ta4464292b":"From Downtown Menlo Park (South)<br>","ta62bf7368":"From Edgewood Park (West)<br>","ta78e356a3":"Criminal Defense - Redwood City <br>","ta54683e1":"<strong>Client</strong>: Sundeep R<br><strong>Location </strong>– Redwood City<br><strong>Charge(s)</strong> – Rape of an Intoxicated Person<br><strong>Attorney </strong>– Tennille Duffy<br><br>Client was arrested for rape of an intoxicated person at a camping trip. We hired an investigator to get statements from other parties at the camp-out and established that alleged victim showed no signs of any trauma and acted jovial the next day.<br><br>‍<strong><em>Result</em></strong><em>: San Mateo District Attorney rejected case – (currently working to seal arrest record)</em>","tan6e4d4bc3":"<em>Result</em>","tan4febd617":"Client <span class=\"header-spanv\">Testimonials</span>","ta1b11ee9a":"Real People. <span class=\"header-spanv\">Real Stories.</span>","ta429ad2f0":"<strong>Jessica r.</strong>","tan113e5674":"<strong>Timothy T.</strong>","ta3f0e97bd":"<strong>Emily C.</strong>","tan31b61cae":"Daily City<br>","ta5f246fd9":"<strong>Norma P.</strong>","ta349f09cd":"Redwood City<br>","tan6dc3e991":"<strong>Ron N.</strong>","tan5d73255c":"Milbrae<br>","tan23958652":"<strong>Walter A.</strong>","ta573f0a16":"<strong>Barbara W.</strong>","ta19277b7c":"San Carlos<br>","ta4fcbf371":"<br>Would give this firm 100 stars. &nbsp;Honest and straightforward explanation of risks and benefit of a DUI case. &nbsp;Managed to reduce my case to reckless driving after a suppression hearing that was brilliantly argued. &nbsp;","ta3a64041e":"<strong>Stephan G.</strong>","ta55d9e2d1":"Belmont<br>"},"richtext":{"r68e2547e":"\n              <h3>ACCUSED OF A CRIMINAL OFFENSE? CONTACT A REDWOOD CITY DOMESTIC VIOLENCE ATTORNEY.</h3>\n              <p>Our Redwood City Dui Attorney handle felony and misdemeanor matters arising in San Mateo counties. Our Redwood City office serves residents of Burlingame, Millbrae, Daily City, Atherton, Half Moon Bay, Brisbane, Foster City, Woodside and Belmont.</p>\n              <h3>Listed below are some of the cases our attorneys frequently handle in Redwood City:</h3>\n              <ul role=\"list\">\n                <li>\n                  <a href=\"https://www.summitdefense.com/firm-locations/redwood-city/redwood-city-domestic-violence-lawyer/\"><strong>Domestic Violence</strong></a>\n                </li>\n                <li>\n                  <a href=\"https://www.summitdefense.com/dui/\"><strong>DUI/Drunk Driving</strong></a>\n                </li>\n                <li>\n                  <a href=\"https://www.summitdefense.com/theft-crimes/\"><strong>Theft and Shoplifting</strong></a>\n                </li>\n                <li>\n                  <a href=\"https://www.summitdefense.com/sex-crimes/\"><strong>Sex Offenses</strong></a>\n                </li>\n                <li>\n                  <a href=\"https://www.summitdefense.com/business-crimes/embezzlement/\"><strong>Embezzlement</strong></a>\n                </li>\n                <li>\n                  <a href=\"https://www.summitdefense.com/traffic-offenses/hit-and-run/\"><strong>Hit and Run</strong></a>\n                </li>\n              </ul>\n              <h3>Court Information for Redwood City CA 94063</h3>\n              <p>If you are charged with committing an offense in San Mateo, your case will be dealt with at the Hall of Justice and Records, at 400 County Center, Redwood City. If you need to attend the Traffic Court, however, you will need to go to the Southern Branch of the Court on the corner of Hamilton Street and Middlefield Road, at 500 County Center, Redwood City.</p>\n              <h3>DO I HAVE TO ATTEND COURT, OR CAN MY ATTORNEY GO FOR ME?</h3>\n              <p>An advantage to having an attorney represent you is that, in many cases, they can go to court for you. Your attorney can attend court for you in all misdemeanor cases, except domestic violence matters. If you have been charged with a felony, however, you must attend court. You must also attend court in any case where the judge orders you to appear.</p>\n              <h3>CAN I LOOK UP THE REDWOOD CITY COURT CALENDAR ONLINE?</h3>\n              <p>No, you cannot access the court calendar for Redwood City online. Your Summit Defense attorney will let you know when your case is next listed, and give you plenty of notice if you need to attend court. If you do not have an attorney, you can contact the courthouse at (650) 363-4711 from 10am to 2pm Monday to Thursday, and from 10am to 12 noon on Fridays, to find out when your case is next in court.</p>\n              <h3>WHERE IS THE JAIL FOR BURLINGAME AND REDWOOD CITY?</h3>\n              <p>Most people who are arrested in the San Mateo area will initially be taken to the Maple Street Transitional Facility. This is located at 1580 Maple Street, Redwood City. This is the jail where all inmates are received and processed. Some prisoners will stay there if they remain in custody, and others are transferred to the Maguire Correctional Facility, located at 300 Bradford Street, Redwood City. Note that there is a women’s only facility at the Maple Street Jail, and that only men are housed at the Maguire Correctional Facility.</p>\n              <p>The San Mateo Sheriff’s Department runs both of these facilities. To check where an inmate is being held, you can contact the Maple Street Facility by calling (650) 363-4310, and the Maguire Correctional Facility by calling (650) 363-4000.</p>\n              <h3>HOW DO I VISIT SOMEONE IN JAIL IN REDWOOD CITY?</h3>\n              <p>To visit an inmate held at one of the Redwood City Jails, you need to attend the correct jail during the scheduled visiting hours. Each jail has a different visiting schedule, which are displayed on the Sheriff’s Department website <a href=\"http://smcsheriff.com/inmate-visitation-maple-street-correctional-center\">here</a> and <a href=\"http://smcsheriff.com/inmate-visitation-maguire-correctional-facility\">here</a>.</p>\n              <p>Once you know the applicable visiting time, you need to arrive at the jail between one hour and fifteen minutes before visiting time starts. This is because you have to go through the registration process, and also through a security check. You need to make sure that you allow plenty of time for those processes to occur because visit times can often be crowded.</p>\n              <p>Before you visit an inmate in either of the Redwood City jails, you need to be familiar with the rules for visitors. There are strict rules about what you need to wear, who can visit inmates, how many visitors an inmate can have at one time and what property you are allowed and not allowed to take into the jail. A full list of the rules is displayed on the San Mateo County Sheriff’s Department website, underneath the visiting times schedule for each jail. Beware that if you do not follow the rules, you may be prohibited from visiting at all.</p>\n              <h3>HOW DO I HELP MY FRIEND OR RELATIVE BAIL OUT IN SAN MATEO AND REDWOOD CITY?</h3>\n              <p>After someone is arrested, their bail is set either at the police station when they are booked, or after they have appeared in court before a judge. Unless they are released on their own recognizance, bail will need to be posted before they can be released.</p>\n              <p>To post bail for someone who has been arrested in Redwood city, and is being held at one of the Redwood City Jails, you need to attend that jail. There is a cashier’s window in the lobby of each jail, and you can pay either cash bail or post a bail bond.</p>\n              <p>If you are represented by Summit Defense Attorneys, we can recommend a bail bonds company that offers our clients a discount. In some cases, it may be possible to post a property bond if the accused person, or someone willing to post bail for them, owns a house or some other kind of property. If you would like to know if it’s possible to post a property bond in your case, speak to your attorney for more information.</p>\n              <h3>CAN I LOOK UP MY BURLINGAME OR REDWOOD CITY CA CRIMINAL RECORD ONLINE?</h3>\n              <p>No, you cannot – official criminal records are not available online. You can, however, search the court records index online, <a href=\"http://www.sanmateocourt.org/midx/\">here</a>. You can also attend the court and ask to view files in person, or request copies of your criminal court records by mail.</p>\n              <p>To request a copy of your criminal record by mail, you will need to provide:</p>\n              <ul role=\"list\">\n                <li>Case number</li>\n                <li>Defendant’s name</li>\n                <li>Approximate filed date of the document or description</li>\n                <li>Self-addressed postage paid envelope</li>\n                <li>Appropriate fee</li>\n              </ul>\n              <p>If you don’t have your case number, you can find it by searching the court records index online. Requests should be sent to the San Mateo Superior Court, Criminal Division, 400 County Center, 4th Floor, Redwood City, California 94063.</p>\n              <p>If you need a full and complete copy of your criminal record, such as for expungement proceedings, you must apply for an official copy from the California Department of Justice. This requires fingerprinting at an accredited livescan facility, submission of a form, and the appropriate fee. More information can be found on the Department of Justice website, <a href=\"https://oag.ca.gov/fingerprints/security\">here</a>.</p>\n              <h3>Highly Rated Criminal Defense Attorney in Redwood City, California</h3>\n              <p>\n                <a href=\"https://g.page/summit-defense-redwood-city?share\">Summit Defense</a> is located on 370 Convention Way #316, <a href=\"https://goo.gl/maps/jKF4HYbQjB3ThhPT7\">Redwood City</a>. From <a href=\"https://goo.gl/maps/WgHM8vrmba9NpS7B9\">San Francisco International Airport (SFO)</a> head south and keep left, follow signs for US-101 S/San Jose and merge onto US-101 S. Then use the right 2 lanes to take exit 409 toward Whipple Ave to merge onto Veterans Blvd. Finally, turn left onto Convention Way and Summit Defense will be on your left.\n              </p>\n              <p>We’re open 24 Hours.</p>\n              <p>For additional questions you can call us at (650) 667-4141 or you can find us on <a href=\"https://www.yelp.com/biz/summit-defense-redwood-city\">Yelp</a>.</p>\n            "},"iframe":{"i75bcee2":"https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d6331.13935471882!2d-122.229093!3d37.49448!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x0%3A0x1b25c944da7130e5!2sSummit%20Defense!5e0!3m2!1sen!2sus!4v1634121588224!5m2!1sen!2sus"}}