{"img":{"i3e90cb95":{"src":"/assets/images/tennille-duffy.jpg","alt":"","sizes":""},"in2769c147":{"src":"/assets/images/tennille-duffy-1.jpg","alt":"","sizes":""},"in555f2e74":{"src":"/assets/images/group-229.png","alt":"","sizes":""},"in556d45f5":{"src":"/assets/images/group-228.png","alt":"","sizes":""}},"link":{"a23":"#"},"text":{"tn2cedb9a9":"Attorney Tennille Duffy","t2268ff":"Home","t75a55ab1":"\n            <a href=\"/\" class=\"breadcrumb-links\" data-text=\"t2268ff\">Home</a> » Attorney Tennille Duffy\n          ","t2a742cf5":"Tennille Duffy","tn2bf5a469":"ATTORNEY AT LAW","tn5792340":"About Tennille","tn63e03e87":"Awards &amp; Memberships","t661d8788":"Education","t5a0ea5a1":"Thank you! Your submission has been received!","tn7c112e99":"Oops! Something went wrong while submitting the form.","tn7d6c0869":"Attorney At Law","tn1827921f":"Awards &amp; Memberships:","t616abd81":"12 years in practice.","tna5380b6":"Admitted to practice in the Supreme Court of NSW, 2005.","t6e795654":"Admitted to practice in the High Court of Australia, 2006.","tn35d95e44":"Admitted to the California Bar, 2014.","tn5a6fe059":"Member of the National Lawyer’s Guild, San Francisco Bay Area Chapter – specifically, Demonstrations Committee and Police &amp; Prisons Committee.","tn11c8da88":"Co-chair of the Essie Justice Group Program Team.","tn3ed1aa46":"First in Health Law and first in Advanced Criminal Law. Graduated with second class Honors.","t3ab79b2":"EDUCATION:","tn37d44c62":"Graduated from University of Newcastle with a Bachelor of Arts 2002,","tn6d87e30a":"Bachelor of Laws and Diploma of Legal Practice 2004"},"textarea":{"ta170f068d":"Request a Free <br>Consultation","ta744d2bcc":"Tennille Duffy has a unique professional background that sets her apart as an attorney that critically examines the actions of the police and the prosecution, from every angle, to best defend her client’s rights. With over ten years of experience, she has the well-developed instincts of a seasoned defense attorney and takes great pride in her commitment to her clients. This is shown in the trusting relationships she builds with them, and the confidence they have in her. <br><br>Ms. Duffy is an Australian-trained attorney who excelled at law school, achieving entry into a competitive practical law program, placing first in Advanced Criminal Law in her final year, and being awarded her law degree with Honors. She began her career in Sydney by clerking for a Supreme Court Judge. She then moved into a criminal defense practice where she represented clients in matters ranging from shoplifting and DUI to sexual assault and murder and has conducted hundreds of trials. &nbsp; She earned a reputation as an honest and forthright advocate who was always well prepared and was not afraid to stand up to the police or their witnesses in court. Tennille then took a break from criminal defense to work in New Delhi, India, in international police reform efforts and in legal education. She also spent a semester teaching Criminal Law at the University of New South Wales, one of the top law schools in Australia.<br><br>Motivated to return to criminal defense so she could again do the direct work she so enjoys in representing clients, Tennille passed the California Bar Exam and moved to the Bay Area in 2013. She immediately connected with Summit Defense’s philosophy of providing the highest levels of care and service to their clients, as well as the goal of achieving a dismissal or a win at trial in every case. Her significant time in criminal defense and criminal justice work means that she has the creativity and resourcefulness to build a case against stiff opposition.","tan4fa15f6b":"Tennille’s commitment to working for social justice the Bay Area community is shown in the volunteer work that she does. In 2015, she volunteered at the <em>Eviction Defense Collaborative</em> in San Francisco, providing legal advice and representation to people facing eviction from their homes. She is a current member of the<em>National Lawyer’s Guild</em> and regularly represents clients <em>pro bono</em> who would otherwise not have a lawyer. Finally, she is particularly passionate about her work at the <em>Essie Justice Group</em>, an Oakland-based organization that supports women with incarcerated loved ones, where is a member of the Program Team."},"richtext":{},"iframe":{}}