{"img":{"in8782bbc":{"src":"/assets/images/polygon-6.png","alt":"","sizes":""},"ic8a39f4":{"src":"/assets/images/image.jpg","alt":"","srcset":["/assets/images/image-p-500.jpeg 500w","/assets/images/image.jpg 694w"],"sizes":"(max-width: 767px) 90vw, (max-width: 991px) 87vw, (max-width: 1279px) 85vw, (max-width: 1439px) 83vw, (max-width: 1919px) 1087px, 1460px"},"i4b82d9af":{"src":"/assets/images/group-228-1.png","alt":"","sizes":""},"i969ffa0":{"src":"/assets/images/arrow-left.png","alt":"","sizes":""},"i519f0e04":{"src":"/assets/images/arrow-left-1.png","alt":"","sizes":""},"in319d2851":{"src":"/assets/images/left-quote-1.png","alt":"","sizes":""}},"link":{"a-48640e09":"tel:(415)666-2316","a-56cdd24a":"https://www.google.com/maps/dir//Summit+Defense,+580+California+St+12th+Floor,+San+Francisco,+CA+94104/@37.792996,-122.404119,14z/data=!3m1!5s0x8085808a489739c1:0xa765adad0c87e7ea!4m8!4m7!1m0!1m5!1m1!1s0x8085808a4dced8e1:0xbee83a5c2e62487f!2m2!1d-122.4041186!2d37.7929964?hl=en","a23":"#"},"text":{"t24c06f1c":"SAN FRANCISCO CA Law OFFICE","t124a499c":"Phone : (415) 666-2316","t6be30b0d":"Driving Directions","t2268ff":"Home","t483338af":"\n            <a href=\"/\" class=\"breadcrumb-links\" data-text=\"t2268ff\">Home</a> » <a href=\"firm-locations\" class=\"breadcrumb-links\">Locations </a>» San Francisco\n          ","tn2d478f5e":"Locations ","t3d68ab9e":"COMMON QUESTIONS ABOUT CRIMINAL DEFENSE","t62a31836":"CAN I GET ARRESTED IF I’M INNOCENT?","t2bf7de7f":"DOES CALIFORNIA HAVE A 3 STRIKES LAW?","t2bab0f6e":"Yes, <a href=\"https://www.courts.ca.gov/20142.htm\" target=\"_blank\">California’s Three Strikes Law</a> will classify a felony charge as a “strike”. This means that an individual will obtain a harsher penalty with each felony they commit. What’s disturbing about this law is that if an individual is charged with their third strike offense, they’ll likely be facing 25 years to life in jail. This will most likely be the third strike penalty regardless of the typical penalty associated with the underlying offense.","tn740c5c2d":"California’s Three Strikes Law","tn3da7c954":"HOW CAN I HIRE A LAWYER WITH NO MONEY?","tnb417600":"You can still hire a lawyer if you’re short on finances, which is many times the case for college students and countless individuals throughout the San Francisco Bay Area.What you’ll likely end up doing is hire a deputy public defender that works for San Francisco County, this person will provide free legal counsel for a whole variety of criminal cases.","t1b2e47a3":"ARE PRIVATE ATTORNEYS BETTER THAN PUBLIC DEFENDERS?","t4c0e8ef8":"Although it’s possible for you to appoint a public defender to your case, it’s important to understand that public defenders in San Francisco will largely be overworked and navigating dozens of cases simultaneously. This subsequently means that your case will not get the attention to detail that it undoubtedly requires.No matter what type of criminal charge you’re facing, a California state-appointed public defender won’t have the legal knowledge that’s necessary to provide you with a comprehensive, well-rounded defense strategy. There’s no reason to unnecessarily put your future in jeopardy due to lack of adequate legal counsel, and hiring a private attorney will give your case the edge it needs to come away with a successful outcome.","t5484b68b":"DO CRIMINAL DEFENSE LAWYERS PREFER THEIR CLIENTS TO BE 100% HONEST WITH THEM?","tn14e68720":"Absolutely. It’s necessary for clients to be 100% honest with our criminal law specialists because we’ll need as much candid information as possible to provide you with your very best course for legal action. We’ll need to know the intricate details oriented around the facts of your case, and this requires being completely honest during your free consultation.","t727ffeab":"I WASN’T READ MY MIRANDA RIGHTS. CAN MY CASE BE DISMISSED?","t696653cb":"Yes, it’s possible for your charges to be dismissed when police officers didn’t provide you with your Miranda Rights in the moments while you’re being taken into custody. This is a serious violation of your Constitutional rights, and an experienced criminal defense lawyer will be capable of getting your case dismissed in these situations.","tn64ca12b6":"DO I NEED A LAWYER IF I’M INNOCENT?","t313ce6a":"You should have legal representation supporting your criminal defense whether you’re innocent or guilty of a crime. Hiring an experienced criminal defense attorney in San Francisco CA will always go a long way to ensure that you’re being respected throughout the entirety of the legal process, and to reduce your chances of being wrongly convicted.It’s important to understand that prosecutors in the San Francisco Bay Area have years of experience trying criminal cases, so you should have a skilled attorney that’s attuned to the local criminal justice system as your source of legal protection.","t3db69c74":"WHAT’S A PLEA BARGAIN? SHOULD I ACCEPT A DEAL?","t32c5caf8":"A plea bargain is an offer provided by the prosecution in a criminal case, and in most cases a defendant will agree to plead guilty during these negotiations in exchange for reduced penalties and/or a reduction in charges. When you accept a plea bargain, your guilty plea will become a part of your criminal record.Your attorney will be your best source of information when it comes to helping you weigh the pros and cons associated with a plea bargain, and it’s important to note that the best course for legal action is unique for every particular case. So you should never accept a plea bargain deal prior to obtaining legal advice from one of our criminal defense attorneys.","tn1f22417f":"WHAT’S THE DIFFERENCE BETWEEN A MISDEMEANOR AND A FELONY?","t205fc50b":"Misdemeanors are specific crimes that can lead to up to one year in a San Francisco County jail. Felonies are much more serious crimes that can carry considerable jail time, ranging from 16 months to life in prison.Felonies tend to pertain to acts of violence and physical harm to another individual, and misdemeanors tend to be less serious offenses. It’s also important to note that your criminal record will play a role in determining the level of criminal charge that you’ll end up facing.","tn6fc5d789":"HALL OF JUSTICE BUILDING","tnc4da38c":"850 Bryant Street, San Francisco","tn140517b6":"CIVIC CENTER COURTHOUSE","tn468efe5b":"400 McAllister St.","t37eaa2cd":"COMMUNITY JUSTICE CENTER","t52ff7754":"575 Polk Street, San Francisco","t4c9fa638":"DRIVING DIRECTIONS TO OUR SAN FRANCISCO CA OFFICE","t67ff9396":"From North Point Centre in North Beach, drive East onto Bay St. Drive for .2 miles until you reach Pier 35. Take a right onto the Embarcadero. Follow the Embarcadero for .8 miles, passing Levi’s Plaza, The Battery, and The Punchline. Take a right onto California St. when you see San Francisco Soup Company. Follow California for 0.2 miles. Our office will be on your right, next to Events and Adventures San Francisco.","t7800e634":"From Alta Plaza Park turn onto Jackson St., heading West. Take a quick right onto Webster St, passing California Pacific Medical Center on your left. After 0.4 miles, take a left onto Bush St. Follow Bush St. for 1.5 miles, passing People’s Barber, St Francis Memorial Hospital, and the Dragon’s Gate as you go. Take a left onto Kearny St., and after two blocks, a right onto California St. Our office will be just to your left, kitty-corner from Wells Fargo and Newport Asia.","tn562148d6":"From Gene Friend Recreation Center in South of Market, drive onto 6th St. going North. After 0.5 miles, you’ll see Dottie’s True Blue Café. 6th St. will turn into Taylor St. and Veer right slightly. Follow Taylor St. for half a mile passing Glide Memorial Church and Honey Honey Café &amp; Crepery as you go. Turn right onto Bush St. right after passing Sanraku. Follow Bush, then take a left onto Kearny St. Drive North two blocks and our office will be on your right, in the same building as the Social Security Administration.","t17f37755":"From the heart of the Financial District, head South on Battery St. Passing Sensor Tower and Michael Mina. Take a right onto California St. Pass the Bank of California Museum and Wells Forgo History Museum, our office will be on your right.","tn17679a54":"JAILS IN SAN FRANCISCO","te8ef110":"HOW DO I VISIT SOMEONE IN JAIL IN SAN FRANCISCO?","t6ee46653":"Phillip Burton Federal Building and U.S. Courthouse","tn492ffb26":"450 Golden Gate Ave, San Francisco, CA 94102, USA","tn64b7f6e6":"United States District Court","tn53b0bf2a":"1301 Clay St #400S, Oakland, CA 94612, USA","tn14c465e9":"San Francisco Federal Building","t66186fac":"The San Francisco Federal Building is an 18-story, 71.3 m …","tn76f68103":"Superior Court of California","t1128f3d9":"375 Woodside Ave, San Francisco, CA 94127, USA","tn4ebb0c7c":"related links","tn68febc4a":"Domestic Violence - San Francisco ","t7b791a25":"DUI - San Francisco","tn384e133b":"Sex Crime - San Francisco"},"textarea":{"tan1eaafa8e":"<br>SAN FRANCISCO CRIMINAL DEFENSE ATTORNEY<br>‍","tan69358cc8":"<strong class=\"bold-text-18\">Summit Defense</strong><br>580 California Street, 12th Floor, San Francisco, CA 94104","ta7f961d7c":"Innocent people end up being arrested in San Francisco CA all the time. It’s possible to be arrested as the victim of improper identification, or you could simply just be in the wrong place at the wrong time.<br>If you are innocent and end up being arrested, it’s still absolutely critical to obtain legal counsel from an experienced San Francisco office that specializes in criminal law. You should never accept an interview with law enforcement prior to speaking with your attorney because the odds are that you’ll only make matters worse for yourself.","tan2c4327a6":"SAN FRANCISCO CRIMINAL COURT INFORMATION<br>","ta7051f50a":"<strong>Cases Handled:</strong> General: Most San Francisco criminal matters are heard in this court including traffic court.","tan7d2b6816":"Phone:<br>‍<a href=\"tel:(415)551-4000\" class=\"link-9\">(415) 551-4000</a>\n                  ","ta6869bf04":"<strong>Cases Handled: </strong>Civil, family law, probate and some criminal cases.","tan6219bb17":"Directions to our San Francisco office<br>","tan78dbb72":"HIRE AN EXPERIENCED TEAM OF CRIMINAL DEFENSE LAWYERS TO FIGHT FOR YOU<br>","ta566aa0f":"CALL OUR SAN FRANCISCO CRIMINAL DEFENSE LAWYERS FOR A FREE CONSULTATION<br>","tan3a48ea48":"<strong>From North (North Beach)</strong>","tan7cee6772":"<strong>From East (Lower Pacific Heights)</strong>","ta7bf7d476":"<strong>From South (South of Market)</strong>","tan5fc2a909":"<strong>From West (Financial District)</strong>","ta9720f26":"Federal Court Locations<br>","tan2b971d9a":"Phone:<br>‍<a href=\"tel:415-522-2000\" class=\"link-9\">+1 415-522-2000</a>\n                  ","tan488c81a":"Phone:<br>‍<a href=\"tel:510-637-3530\" class=\"link-9\">+1 510-637-3530</a>\n                  ","tan44ad2723":"Phone:<br>‍<a href=\"tel:800-333-4636\" class=\"link-9\">+1 800-333-4636</a>\n                  ","ta7dec6c43":"Phone:<br>‍<a href=\"tel:415-682-5100\" class=\"link-9\">+1 415-682-5100</a>\n                  ","tan4febd617":"Client <span class=\"header-spanv\">Testimonials</span>","ta1b11ee9a":"Real People. <span class=\"header-spanv\">Real Stories.</span>","tan63a43c3d":"<br>Attorney Ross Pytlik’s legal knowledge, sensitivity, ethics, and courtroom skills are truly the “best-of-the-best”. Ross was prompt returning our calls, and thorough explaining the legal implications of a family situation. Ross developed, explained and implemented a very skillful legal strategy that was successful, and provided an opportunity for a second chance toward a productive life. Attorney Pytlik’s work literally changed our lives, and we are forever grateful to Mr. Pytlik.","ta80df":"<strong> Ed</strong>"},"richtext":{"r56aeab63":"\n              <h3>CONTACT A TEAM OF AGGRESSIVE SAN FRANCISCO CRIMINAL DEFENSE ATTORNEYS TODAY</h3>\n              <p>\n                <a href=\"https://www.summitdefense.com/attorneys/\" target=\"_blank\">Summit Defense</a> is widely recognized throughout the national criminal defense industry as a leader in criminal law. We pride ourselves on providing legal counsel for a whole variety of criminal matters pertaining to citizens of San Francisco CA and beyond.\n              </p>\n              <p>Our law firm of San Francisco criminal defense attorneys has over 120 years of experience, and we understand how important it is for you or your loved one to hire an experienced criminal defense attorney for your legal advice and aggressive representation. Our skilled criminal law specialists have the legal knowledge and criminal justice system experience to provide you with the legal strategy that leads to a significant victory.</p>\n              <p>Below we’ll be providing a comprehensive overview oriented around how our law office goes about defending clients that are facing criminal charges in San Francisco, and you can always <a href=\"https://www.summitdefense.com/contact/\" target=\"_blank\">reach out to us online</a> for a free consultation to obtain further legal advice about your unique situation from one of our criminal defense lawyers.</p>\n              <h3>REPRESENTING A WIDE SPECTRUM OF CRIMINAL DEFENSE CASES IN THE SAN FRANCISCO BAY AREA</h3>\n              <p>There’s no denying how stressful it can be when you’re facing any degree of criminal charges, which is why it’s so critical to obtain legal advice from a San Francisco criminal lawyer as soon as you possibly can in these situations. Your freedom and long-term future will many times be in jeopardy when you’ve been arrested for any criminal charges, but having an experienced defense team that knows the criminal justice system in San Francisco CA will ultimately provide you with your best opportunity for a favorable outcome.</p>\n              <p>Our team of criminal defense attorneys has helped countless clients in Northern California achieve victories when they’ve faced all sorts of criminal charges, including cases that involve the following:</p>\n              <ul role=\"list\">\n                <li>Violent crimes</li>\n                <li>White collar crimes</li>\n                <li>Domestic violence</li>\n                <li>Drug crimes</li>\n                <li>Sex crimes</li>\n                <li>Property crimes</li>\n                <li>Theft crimes</li>\n                <li>Battery</li>\n                <li>Robbery</li>\n                <li>Burglary</li>\n                <li>Computer crimes</li>\n                <li>Felony cases</li>\n                <li>Misdemeanor cases</li>\n                <li>Assault</li>\n                <li>DUI &amp; DWI</li>\n                <li>Marijuana law</li>\n                <li>Probation violation</li>\n                <li>Cases that involve federal courts</li>\n                <li>And much more that you can see on our <a href=\"https://www.summitdefense.com/crimes-we-defend/\" target=\"_blank\">Crimes We Defend</a> page…</li>\n              </ul>\n              <p>As you can most likely imagine, obtaining a favorable outcome when you’re accused of any of the above criminal charges is a lot easier said than done. Our attorneys defend clients throughout the Bay Area to the best of our abilities, and our connections with the district attorney, police officers, judges, and prosecutors help us reduce your charges and eliminate your overall chances of jail time.</p>\n              <p>Our criminal defense lawyers know just how convoluted the criminal justice system is in San Francisco CA, and you can count on our team to provide you with the legal advice that formulates your very best course for legal action within San Francisco County courts.</p>\n              <h3>CALIFORNIA CRIMINAL DEFENSE LAWS</h3>\n              <p>California is a unique state when it comes to a whole variety of legal matters, and criminal law is no different. Check out this link to a <a href=\"https://www.hg.org/california-criminal-defense-law-guide.html\" target=\"_blank\">California Criminal Defense Law Guide</a> to dive into the specifics about sentencing laws, sentence reductions, expungements, domestic violence laws, drug crime laws, DUI laws, sex crime laws, white-collar criminal law, violent crime law, burglary/theft and a lot more!</p>\n              <p>The penalties associated with your criminal charges will largely depend upon the unique circumstances permeating throughout your unfortunate incident, which is why you’re undoubtedly going to need to speak with a San Francisco criminal defense attorney at our law firm as soon as you can. We’re a nationally recognized law office that specializes in criminal defense, and we’ve supported thousands of clients facing all sorts of criminal matters in Northern California.</p>\n            ","r5e7db1ed":"\n              <p>When you consider the overall severity associated with a criminal charge conviction in the San Francisco Bay Area, you should always seek experienced legal counsel from a deputy public defender or experienced criminal attorney in a timely manner.</p>\n              <p>At Summit Defense, we defend clients accused of criminal charges through aggressive representation. We understand how stressful it can be when you’ve been arrested or accused of any charges; which is why our criminal defense specialists will do whatever is necessary to successfully guide you through the criminal law that applies to your charges and utilize our San Francisco criminal defense experience to obtain your most favorable outcome.</p>\n              <h3>WHAT TO EXPECT FROM OUR CRIMINAL LAW FIRM</h3>\n              <p>Facing criminal charges is always a frustrating and unsettling scenario no matter what specific charges you’re dealing with, and this is mainly because you’ll be facing a prosecutor that could potentially put you on probation or in jail. The criminal justice system is not always forgiving in San Francisco CA, but our criminal defense attorneys will ensure that you’re provided with “white glove” legal services that properly handle every intricate detail of your unique defense strategy.</p>\n              <p>Our <a href=\"https://www.summitdefense.com/case-results/\" target=\"_blank\">case results</a> will undoubtedly speak for themselves and how we’ll develop the foundation of your course for legal action, and you can expect the following when our attorneys are representing you or your loved one:</p>\n              <ul role=\"list\">\n                <li>Direct access to our criminal defense lawyers, who will provide you with the personal attention and overall legal services that you require at your convenience.</li>\n                <li>Top-notch protection during interviews with investigators, police officers, prosecutors and many other law enforcement agents.</li>\n                <li>An in-depth case evaluation that identifies the strengths and weaknesses of your defense, which becomes the foundation for your legal strategy.</li>\n                <li>Access to our many important resources, including private investigators, forensic investigators, and many other professional specialists to counteract a prosecution’s case and group of expert witnesses.</li>\n                <li>A comprehensive review of lab processes, lab results, potential errors in chain of custody of evidence, and more thorough scientific analyses.</li>\n                <li>A review of the conduct of police officers within your case, which can potentially identify any misconduct or rights violations.</li>\n                <li>Interviewing any witnesses that will support your defense.</li>\n                <li>Identifying possible suspects that committed the criminal act and obtaining your acquittal.</li>\n              </ul>\n              <p> </p>\n              <p>All of our criminal law specialists in the San Francisco Bay Area take our legal representation duties very seriously, so you can be rest assured that you’ll be treated with compassion and respect. We help clients accused of all sorts of criminal cases, including violent crimes, white-collar crimes, domestic violence cases, drug offenses, sex crimes, theft crimes, violent crimes, and much more.</p>\n              <p>Never undergo an interview with law enforcement officers without having your legal counsel present with you to protect you and your defense strategies!</p>\n              <p> </p>\n              <p>‍</p>\n            ","rn413f8e1f":"\n                  <p>To find out which court you are in, please see the Daily Calendar posted at Room 101 at the Hall of Justice Building, or you can contact the clerk’s office on (415) 551-0322. However, if you have retained an attorney, they will find out which court your case is in and let you know where you need to go – and if you need to attend court at all.</p>\n                ","r2ca60c39":"\n                <p>\n                  <a href=\"https://g.page/summit-defense-san-francisco?share\">Summit Defense</a> is located on 580 California St 12th floor, <a href=\"https://goo.gl/maps/ckZAVZjokVuocYKq8\">San Francisco</a>. From <a href=\"https://goo.gl/maps/CeKBXyGZ9KyfFSa8A\">San Francisco International Airport (SFO)</a> head northwest and keep left at the fork to continue toward Airport Access Rd. Then keep left at the fork to continue toward Airport Access Rd and continue onto Airport Access Rd. Next, use the left lane to turn slightly left to stay on Airport Access Rd and continue straight to stay on Airport Access Rd. After that, make a U-turn and use the 2nd from the right lane to keep right at the fork, follow signs for US-101 N/San Francisco and merge onto US-101 N. At this point, use the right 2 lanes to take exit 430A to merge onto I-280 N and take exit 56 toward Mariposa Street. Use the right 2 lanes to turn slightly left onto Owens St and turn right onto 16th St. At 1.7 miles, turn left onto 3rd St. Finally, continue onto Kearny St and Summit Defense will be on your left.\n                </p>\n                <p>We’re open 24 Hours.</p>\n                <p>For additional questions you can call us at (415) 666-2316 or you can find us on <a href=\"https://www.yelp.com/biz/summit-defense-san-francisco-2\">Yelp</a>.</p>\n              ","rn66b86dac":"\n                <p>Choosing a San Francisco criminal defense attorney is a difficult process, which is why we try to make this process easier by providing a free consultation.</p>\n                <p>\n                  <a href=\"https://www.summitdefense.com/contact/\" target=\"_blank\">Contact us online</a> or call us at 1-866-560-4276 to see how our criminal law specialists can support you or your loved one during this difficult time. We look forward to meeting you and discussing your defense needs as we formulate your best legal strategy.\n                </p>\n              ","rn262a744":"\n                <p>There are several county jails in San Francisco, as well as one located in San Bruno (although still within the jurisdiction of San Francisco county). They are run by the Sheriff’s Department.</p>\n              ","rn7c0602ea":"\n                <p><strong>County Jail #1 at 425 7th Street</strong></p>\n                <p>‍</p>\n                <p>All prisoners are initially booked in through this jail in San Francisco, but moved to on of the other facilities after booking is complete.</p>\n              ","rn1a02a673":"\n                <p><strong>County Jail #2 on 7th Street</strong></p>\n                <p>‍</p>\n                <p>This facility houses both men and women inmates, but is the only jail in San Francisco that houses women.</p>\n              ","rn3f5128bf":"\n                <p><strong>County Jail #4 at Bryant Street</strong></p>\n                <p>‍</p>\n                <p>This jail is the maximum security facility for San Francisco County.</p>\n              ","r15e8464e":"\n                <p><strong>County Jail #5 on Moreland Drive, San Bruno</strong></p>\n                <p>‍</p>\n                <p>This large facility is actually located in San Mateo County, but falls under the jurisdiction of San Francisco County and City.</p>\n              ","r4a9a9dca":"\n                <p>If a prisoner requires medical attention or mental health treatment, they are housed in a locked ward at San Francisco General Hospital on Potrero Avenue.</p>\n              ","rn5f93b729":"\n                <p><strong>The Sheriff’s Department requires all visitors to schedule visits to inmate online, except for those who wish to visit people being held in San Francisco General Hospital.</strong></p>\n                <p>‍</p>\n                <p>Visits can be scheduled via the Sheriff’s Department website, here. Visits are available on weekends and holidays, and at the San Bruno jail on Thursday evenings, although attorneys can visit their clients outside of those times. There are strict rules that apply to jail visits, such as time limits and dress requirements. You should make sure that you review the rules carefully beforehand; otherwise you may not be allowed to visit.</p>\n              "},"iframe":{"i5b00a523":"https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d25222.990815449524!2d-122.404119!3d37.792996!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x0%3A0xbee83a5c2e62487f!2sSummit%20Defense!5e0!3m2!1sen!2sus!4v1634113915495!5m2!1sen!2sus","i-4f2741d5":"https://www.youtube.com/embed/RBnt-N-mAqY?rel=0&controls=1&autoplay=0&mute=0&start=0"}}