{"img":{"in6229a1d7":{"src":"/assets/images/patricia-campi.jpg","alt":"","sizes":""},"in201afa1a":{"src":"/assets/images/61705fe3535ec88ed760fc01_patricia-campi.jpg","alt":"","sizes":""},"in555f2e74":{"src":"/assets/images/group-229.png","alt":"","sizes":""},"in556d45f5":{"src":"/assets/images/group-228.png","alt":"","sizes":""}},"link":{"a23":"#","a-5e312cd7":"#awards-memberships","a54b5dee5":"#education"},"text":{"t667e5a4c":"ATTORNEY PATRICIA ANN CAMPI","t2268ff":"Home","tn31b92364":"\n            <a href=\"/\" class=\"breadcrumb-links\" data-text=\"t2268ff\">Home</a> » Attorney Patricia Ann Campi\n          ","tn49266636":"PATRICIA ANN CAMPI","tn2bf5a469":"ATTORNEY AT LAW","t255c0f75":"About Patricia Ann","tn7968bbd6":"Awards and Memberships","t661d8788":"Education","t5a0ea5a1":"Thank you! Your submission has been received!","tn7c112e99":"Oops! Something went wrong while submitting the form.","tn7d6c0869":"Attorney At Law"},"textarea":{"ta170f068d":"Request a Free <br>Consultation","ta41ba915f":"Patricia Campi has been practicing law for the past 27 years all over the State of California after graduating from Ventura College of Law. &nbsp;While she spent her first 15 years practicing in Los Angeles, Orange, Riverside, San Bernardino, Santa Barbara and Ventura Counties, for the last 12 years she has specialized in criminal defense practicing primarily in Sacramento, Placer, El Dorado, Nevada and Yolo Counties.<br><br>As part of our team with Summit Defense she brings a wealth of experience based on all types of cases she has handled throughout her career, ranging from misdemeanors to Three-Strike felony matters, in both state and federal courts.<br><br>Through her diligent representation and commitment to pursuing the best possible outcome for every client, no matter what charges he or she faces, Ms. Campi has a proven track record of delivering favorably significant results, the most recent examples of which are:<br><br>Client was charged with two felonies in violation of Penal Code Section 69 (Resisting an Executive Officer) and Penal Code Section 148.10 (Resisting a Peace Officer/Causing Serious Bodily Harm) and one misdemeanor charge in violation of Penal Code Section 647(f) (Public Intoxication) which presumably provided the Officer with reasonable cause to detain Client in the first place. <br><br>Campi represented Client through a Jury Trial and Client was ACQUITTED on all three counts.<br>Client was charged with multiple felony counts of armed robbery and kidnapping along with two co-defendants in two separate incidents. He was facing life exposure in State Prison if convicted on all counts. &nbsp;After extensive settlement negotiations, Ms. Campi was able to convince the District Attorney that her client deserved leniency due in part to the fact he had no prior criminal record and his involvement in the crime spree was peripheral. &nbsp;The case was ultimately resolved for a plea to two counts of Penal Code Section 32 (Accessory after the Fact) and Client was granted five years formal PROBATION.<br><br>Client was charged with violating Penal Code Section 422(a) as a felony with an enhancement for being personally armed with an Assault Rifle. He faced 18 years exposure in State Prison if convicted. &nbsp;After extensive settlement negotiations with the District Attorney, a plea agreement was reached to grant Client PROBATION. &nbsp;The Court joined in the plea disposition, finding the case to be “unusual” within the meaning of the Rules of Court and overriding the presumption that Client was otherwise ineligible for probation.<br><br>Client was charged with two counts of violating Penal Code Section 243.4(f), misdemeanor sexual battery. &nbsp;If convicted, he would be required to register as a sex offender under Penal Code Section 290. &nbsp;After negotiating with the District Attorney and filing a Statement in Mitigation with the Court, Ms. Campi succeeded in reaching an agreement for a disposition that would allow the Court to suspend imposition of sentence as long as the Client participated in approved sex offender counseling and had no further violations of law involving sexual related conduct, thereby avoiding a conviction and 290 registration.","tan1827921f":"Awards &amp; Memberships:<br>","tan19f22fd6":"2016 National Trial Lawyers Top 100 Lawyers Award – Criminal Defense<br>","tan4a91d5fa":"Juris Doctor – Ventura College of Law – Ventura, CA<br>","ta67c5918c":"Bachelor of Arts – Corrections, California State<br>","tan7a9f6e22":"University – Sacramento, CA<br>","tan642930d5":"Associate of Arts – Criminal Justice, Sierra Junior<br>","ta247c8848":"College – Rocklin, CA<br>"},"richtext":{},"iframe":{}}