{"img":{"i314bef75":{"src":"/assets/images/scott-mossman_1.jpg","alt":"","sizes":""},"in555f2e74":{"src":"/assets/images/group-229.png","alt":"","sizes":""},"in556d45f5":{"src":"/assets/images/group-228.png","alt":"","sizes":""}},"link":{"a23":"#","a-5e312cd7":"#awards-memberships","a54b5dee5":"#education"},"text":{"t4b632875":"Attorney Scott Mossman","t2268ff":"Home","tn613bd5a9":"\n            <a href=\"/\" class=\"breadcrumb-links\" data-text=\"t2268ff\">Home</a> » Attorney Scott Mossman\n          ","t66faf617":"Scott Mossman","tn2bf5a469":"ATTORNEY AT LAW","t4972904c":"About Scott","tn63e03e87":"Awards &amp; Memberships","t661d8788":"Education","t5a0ea5a1":"Thank you! Your submission has been received!","tn7c112e99":"Oops! Something went wrong while submitting the form.","tn7d6c0869":"Attorney At Law","tn2db0061d":"Is my employment visa (H-1, TN, etc.) at risk?","tn58920a34":"What information about my arrest will I have to provide on an immigration form?","tn3fb89a7":"Will I be able to become a naturalized citizen with a criminal conviction?","t57e025af":"Is there any chance of deportation?","tn1827921f":"Awards &amp; Memberships:","tn399a0c2a":"Immigration practice since 2003","tn6fae30a2":"American Immigration Lawyers Association (AILA) 2004 to present","tn1dac2444":"AILA Northern California liaison to Immigration and Customs Enforcement (ICE) from 2013 to 2016","tn26c77863":"AILA Northern California liaison to U.S. Customs and Border Protection from 2010 to 2013","t3ab79b2":"EDUCATION:"},"textarea":{"ta170f068d":"Request a Free <br>Consultation","ta6e5d8339":"Practicing criminal defense in the Bay Area requires special consideration for non-U.S. citizens. The criminal court system is challenging enough, but immigrants may face additional problems that other defense attorneys do not consider. That is why your Summit Defense legal team will include our immigration attorney Scott Mossman if you are not a U.S. citizen. He has extensive experience advising immigrants and their defense counsel on the immigration consequences of criminal charges.<br>‍<br>Non-citizen clients may ask questions such as:<br>","tan5707b324":"Scott regularly answers these and other questions for Summit Defense attorneys and their clients, allowing them to make educated decisions regarding their defense strategies.<br><br>Mr. Mossman is considered to be an expert in the immigration law field and presents seminars to other attorneys on relevant immigration subjects. &nbsp;Some of these seminars include immigration holds and the California Trust Act, recent Supreme Court decisions on the immigration consequences of crime, how to create an immigration-safe record of conviction, and dispositions that avoid meeting the immigration definition of a conviction entirely.<br><br>Scott received his Law Degree from the University of California, Davis, where he graduated in the top 5% of his class. He received his undergraduate degree, magna cum laude, from California State University, Sacramento. Scott is an active member of the American Immigration Lawyers Association (AILA), where he serves as co-liaison to Immigration and Customs Enforcement (ICE) for Northern California. He previously served as an AILA co-liaison to U.S. Customs and Border Protection for 3 years.<br>","tan4030b2f5":"UC Davis, School of Law, 2003, Top 5% of Class<br>","ta5a55e9fe":"CSU Sacramento, Criminal Justice, 2000, Magna Cum Laude<br>"},"richtext":{},"iframe":{}}