{"img":{"i1a7a694b":{"src":"/assets/images/coolicon_3.png","alt":"","sizes":""},"in4af1c242":{"src":"/assets/images/image-43.jpg","alt":"","sizes":""}},"link":{"a23":"#"},"text":{"t4b3a0b1f":"Bay Area Criminal Process","t2268ff":"Home","tn35cbb697":"\n            <a href=\"/\" class=\"breadcrumb-links\" data-text=\"t2268ff\">Home</a> » Bay Area Criminal Process\n          ","tn66995c4e":"criminal process","t17cd2a7f":"PREFILE","t6c74099c":"AFTER ARRAINGMENT","tn1527c47c":"SEARCH AND SEIZURE","t75d6eeb5":"ARREST AND BOOKING","t2dd18c8d":"MISDEMEANOR FELONY","tn47f8f5c":"APPEALS","tn463af664":"ARRAIGMENT","tn6a5feea9":"MIRANDA RIGHTS","tn2c7d9d6c":"FREE CASE REVIEW","tneba0a4d":"RELEASE WITHOUT BAIL","tn42fe82b0":"POLICE POWERS","t4d47461c":"categories","tn4739eddf":"BUSINESS CRIMES","tn48f65e5e":" embezzlement","tn13399b28":"extortion","t5d2aa64":"fraud","t3f15e75d":"DOMESTIC VIOLENCE","t6cd5fa11":"CHILD ABUSE AND ENDANGERMENT","t3e4ccb3":"DRUGS","t6b4cf49e":"MARIJUANA","t109d8":"DUI","t7c459421":"DUI WITH DRUGS","t767c3705":"FELONY DUI","t7c23796f":"FEDERAL CRIME","t53f52f7c":"GENERAL TOPICS","t3fd8c4f1":"OTHER CRIMES","t3ba7fa1":"ARSON","t2759689":"KIDNAPPING","t3098ca50":"PAROLE AND PROBATION VIOLATIONS","t702f354f":"SEARCH AND SEIZURES","tn5cc4f1c1":"THREE STRIKES","tn3aef18a9":"VANDALISM","tnc950125":"SEX CRIMES","t751454f5":"CHILD MOLESTATION","t6b66b3fb":"CHILD PORNOGRAPHY","tn3cb35e27":"INDECENT EXPOSURE","t3125850a":"LEWD CONDUCT","t4d54a130":"PROSTITUTION","tn6e8d14e6":"RAPE ATTORNEY","tn1b82ec9f":"SEX CRIME REGISTRATION","tn5ee2aa49":"SEXUAL ASSAULT","tn489d2af9":"SEXUAL BATTERY","t4c17cdf":"THEFT","tn17874fbc":"BURGLARY","t1f73f8ab":"GRAND THEFT","t5882eafd":"IDENTITY THEFT","t7c4ef0ef":"ROBBERY","tn14d25223":"TRAFFIC","t233aa4d5":"HIT AND RUN","tn5a204d7a":"VIOLENT CRIMES","t6fc79a0e":"ANIMAL CRUELTY","tn6fc3a72b":"ASSAULT WITH A DEADLY WEAPON","t170d39ed":"BATTERY","tn6ae6f106":"GROSS VEHICULAR MANSLAUGHTER","t11ea52ca":"HOMICIDE","tn77c6bbf9":"MURDER","t16bc576f":"VEHICULAR HOMICIDE","t5c30f579":"VOLUNTARY MANSLAUGHTER","t3dc485":"Meet The Team","t2b5e3cec":"With over 120 years of cumulative and exclusive Criminal Defense experience, our reputation for aggressive and results oriented performance, whether in State court or Federal Court, has been documented by several Bay Area news channels and vetted by hundreds of satisfied clients. Our success and industry recognition is the result of our EXCLUSIVE FOCUS on criminal defense; we don’t accept personal injury or family law cases. This single-minded focus allows us to keep pace with the ever-changing landscape of legal doctrine and provide you with the best results possible."},"textarea":{},"richtext":{"rn7ee0d837":"\n              <h3>I HAVEN’T BEEN ARRESTED, BUT MAY BE IN TROUBLE. SHOULD I CONTACT A CRIMINAL DEFENSE LAWYER NOW?</h3>\n              <p>Yes – if someone has accused you of a crime but charges have not yet been filed, then your case is considered to be a <a href=\"https://www.summitdefense.com/criminal-process/prefile/\"><strong>pre-file</strong></a>. If this is your situation, now is the best time to consult an experienced defense firm. A smart <a href=\"https://www.summitdefense.com/firm-locations/san-francisco/\">criminal defense lawyer</a> will take steps to protect you and influence the process in every way possible to prevent criminal charges.</p>\n              <p> </p>\n              <p>A pre-file situation can be compared to the beginning of a fire – your lawyer is a fireman and, if called early enough, may be able to smother the flames before the blaze gets out of control.</p>\n              <p> </p>\n              <p>At Summit Defense Attorneys we are particularly sensitive to the opportunities and risks at the pre-file stage—the wrong attorney may inadvertently fan the flames. WE WON’T. Our attorneys include a <strong>former police officer and prosecutor</strong>. We know how the other side works at every stage of a case.</p>\n              <p> </p>\n              <p>Please do not put your head in the sand and hope for the best! &nbsp;If you are vulnerable to a criminal accusation, let us review your situation confidentially and advise what – if anything – should be done to protect your freedom.</p>\n              <p> </p>\n              <h3>IF I AM ARRESTED, WHAT WILL HAPPEN?</h3>\n              <p>When you are arrested, you will be taken to the police station. While at the station, the police will likely take your personal belongings, your fingerprints, and your photo. This is called <a href=\"https://www.summitdefense.com/criminal-process/arrest-and-booking/\"><strong>booking</strong></a>. Depending on the facts of your case, Summit Defense Attorneys may be able to seal the record of the arrest.</p>\n              <p> </p>\n              <p>If you’ve been charged with a misdemeanor, you may be released after booking and given a future court date. Otherwise, you will be jailed until bailed out, or your Summit Defense Attorneys can arrange an “O.R.” (own recognizance) release.</p>\n              <p> </p>\n              <p>When you are arrested, the police are required to tell you about your rights. These include your right to silence, and your right to a lawyer. These rights are important and you should take full advantage of them. If in custody, it is important to refrain from discussing anything about your case with anybody other than your attorney during a confidential visit. While in the jail, you have no expectation of privacy. Phone calls and letters are monitored and other inmates are often “snitches”.</p>\n              <p> </p>\n              <p>If arrested, it is important to remember that an <strong>arrest is only an accusation</strong>, not a conviction. Often people feel discouraged or even hopeless after going through the drama and humiliation of an arrest. Whatever your circumstances, assume nothing until we’ve evaluated your case. Many Summit Defense clients are arrested before retaining us. These people often tell us that the arrest was their lowest point, but they always feel better after we’ve worked together and created a plan.</p>\n              <p> </p>\n              <h3>DO I HAVE TO TALK TO THE POLICE?</h3>\n              <p>No – you only have to tell them your name and address, and show some identification if requested. If you’ve already been arrested, you were likely handcuffed and taken to the police station. This is considered being in police custody and triggers important rights.</p>\n              <p> </p>\n              <p>While in police custody, law enforcement officials (both state and federal) must <em>Mirandize</em> you before questioning. &nbsp;The <a href=\"https://www.summitdefense.com/criminal-process/miranda-rights/\"><em>Miranda</em></a> warning requires that police advise you of your right to an attorney and your <strong>right to remain silent </strong>when questioned by the police. It also warns that anything you say can be used against you to support their case.</p>\n              <p> </p>\n              <p><strong><em>When faced with questions from law enforcement it is almost always better to assert your Miranda rights and remain silent. Summit Defense Attorneys never lets clients talk to the police—except in rare situations, and only with us present.</em></strong></p>\n              <p> </p>\n              <h3>CAN I BE RELEASED FROM JAIL WITHOUT HAVING TO PAY BAIL?</h3>\n              <p>Yes – an “O.R.” (own recognizance) release means that the court agrees to let you out of custody on your own recognizance without the need to post bail.</p>\n              <p> </p>\n              <p>Once the charging process is complete at the police station, the amount for bail will be set in accordance with the schedule that is applicable in that county. The amount required to secure your bail will depend on the number and seriousness of the charges filed against you and, once it is paid, you will be free to leave the custody of the police.</p>\n              <p> </p>\n              <p>In some very serious cases, or those where the defendant has a criminal history, it is possible that they will not be able to meet the bail set at the police station because it is too high. Alternatively, in the most serious of cases, a defendant may not have the opportunity to secure bail at the police station, but may be required to go before a judge to apply for bail.</p>\n              <p> </p>\n              <p>Judges have a great deal of discretion in deciding whether to require bail or to release a defendant on his or her own recognizance. &nbsp;Some of the factors that are looked at include ties to the community, legal history, employment and support of the community.</p>\n              <p> </p>\n              <p>Your Summit Defense attorney will make a strong argument that might save you thousands of dollars in bail bond fees. Our first priority when clients are in custody is to do everything legally possible to secure their release quickly and with the least cost to our clients.</p>\n              <p> </p>\n              <h4>\n                <a href=\"https://www.summitdefense.com/criminal-process/release-without-bail/\">Release without Bail</a>\n              </h4>\n              <p> </p>\n              <h2>WHAT’S THE DIFFERENCE BETWEEN A MISDEMEANOR AND A FELONY?</h2>\n              <p><strong>Misdemeanors</strong> carry a maximum possible sentence of up to one year in county jail. <strong>Felonies</strong> are generally more serious offenses and can result in being sentenced to imprisonment in state prison for at least a year, and potentially much longer depending on the charge.</p>\n              <p> </p>\n              <p>Some crimes are called ‘<strong>wobblers’</strong>, which means they can be prosecuted as either a misdemeanor or a felony, depending on the circumstances. If you are accused of one of these offenses, the prosecution will decide how you will be charged depending on the circumstances and seriousness of the case, as well as any criminal record that you may have.</p>\n              <p> </p>\n              <p>For example, <strong>domestic violence</strong> and <strong>DUI</strong> can be charged either way depending on the facts and the District Attorney’s discretion. Whether you are charged with a misdemeanor or a felony, there are several potential problems other than jail or prison if convicted. They include:</p>\n              <p> </p>\n              <ul role=\"list\">\n                <li>As an adult, a criminal conviction becomes part of your permanent record and can appear on employer background checks.</li>\n                <li>Drug or sex offender registration.</li>\n                <li>Non-citizens may face immigration issues, including deportation. (If you are a non-citizen, Summit Defense has a <a href=\"https://www.summitdefense.com/attorneys/scott-mossman/\">specialist in-house immigration attorney</a>.)</li>\n                <li>Loss of privileges, including driving, voting, travel, and gun ownership.</li>\n              </ul>\n              <p> </p>\n              <p>At Summit Defense, we are very sensitive to the many ways a criminal conviction can impact your life. <strong><em>Our goal is always the complete dismissal of charges</em></strong> either through negotiation or a not guilty verdict at trial.</p>\n              <p> </p>\n              <h2>WHAT HAPPENS AT THE FIRST COURT APPEARANCE?</h2>\n              <p> </p>\n              <h4>\n                <a href=\"https://www.summitdefense.com/criminal-process/arraignment/\"><strong>Arraignment</strong></a>\n              </h4>\n              <p> </p>\n              <p>Whether you are in or out of custody, your first court appearance after being charged with a crime is called the arraignment. At arraignment:</p>\n              <ul role=\"list\">\n                <li>You will be formally notified of the charges against you.</li>\n                <li>Your lawyer will be provided a copy of the complaint, along with any discovery (police reports and documents related to the case).</li>\n                <li>You will be asked to enter a plea to the charges.</li>\n              </ul>\n              <p> </p>\n              <h4><strong>Entering a not guilty plea</strong></h4>\n              <p>Regardless of the content of the discovery, when invited to enter a plea at arraignment your Summit Defense attorney will almost always enter a not guilty plea on your behalf. A not guilty plea is a way of saying “can you prove it?”</p>\n              <p> </p>\n              <p>In addition to entering a plea, obtaining discovery, and dealing with bail issues if necessary, the arraignment may include discussion regarding court imposed ‘stay away’ orders. For example, in domestic violence cases, it’s not unusual for the court to forbid contact between spouses. &nbsp;Your Summit Defense attorney may be able to prevail upon the court to allow continued contact, when appropriate, by asking for a ‘peaceful contact ‘order. Before the arraignment is over, additional court dates will be set and issues of time waiver will be addressed.</p>\n              <p> </p>\n              <p>Finally, your arraignment is the beginning of a process that could have a significant impact on your life in a variety of ways, such as your freedom, reputation, and career. &nbsp;It is important that your attorney is present and prepared to deal with the variety of issues that can arise.</p>\n              <p> </p>\n              <h4><strong>What if I’ve already confessed?</strong></h4>\n              <p>Even if you’ve confessed to a serious crime, if we can show that the <strong>confession was obtained illegally</strong>, and the prosecutor does not have any other evidence sufficient to prove guilt beyond a reasonable doubt, then the case should be dropped regardless of how “guilty” you might feel. Summit Defense Attorneys believe strongly in the legal presumption of innocence and ensure that your legal rights are protected.</p>\n              <p> </p>\n              <h2>WHAT HAPPENS AFTER THE ARRAIGNMENT?</h2>\n              <h4>\n                <a href=\"https://www.summitdefense.com/criminal-process/case-review/\"><strong>Summit Defense Case Evaluation</strong></a>\n              </h4>\n              <p>After your arraignment, your attorneys will begin the process of evaluating the strengths and weaknesses of the case against you. Often we will try to exclude evidence that may have been illegally obtained. Depending on the case we may bring in <strong>private investigators</strong> and other experts to provide helpful information.</p>\n              <p> </p>\n              <h4><strong>Dismissal of your case</strong></h4>\n              <p><strong><em>Our goal is always the complete dismissal of all charges</em></strong>. This is not always possible, but our thorough approach achieves the best possible outcome. Many times we will prepare a case for trial knowing that a negotiated settlement is more likely. This ‘belt and suspenders’ approach puts us in a stronger negotiating position and we always understand the case better than the opposing counsel.</p>\n              <p> </p>\n              <p>When a complete dismissal is not possible, we can be very creative in resolving your case in a way that minimizes negative consequences. For example, Summit Defense attorneys are well known for crafting options such as:</p>\n              <ul role=\"list\">\n                <li>civil compromises</li>\n                <li>jail alternatives, like counseling or public service</li>\n                <li>first offender programs</li>\n                <li>diversion programs</li>\n              </ul>\n              <p>These and other strategies can be used to protect our client’s freedom and reputation.</p>\n              <p> </p>\n              <h4><strong>Plea Bargain</strong></h4>\n              <p>If we cannot get your case dropped altogether, it will resolve in one of two ways. Either we will agree to a negotiated resolution – a plea bargain – or it will go to trial.</p>\n              <p> </p>\n              <p>Summit Defense attorneys are seasoned trial lawyers and sometimes our reputation and willingness to try cases results in very favorable plea bargains. A favorable plea bargain might include a program that keeps a client’s record clean, like some first offender programs. It could include alternatives to jail, such as home monitoring, community service, therapy and counseling programs.</p>\n              <p> </p>\n              <h4><strong>Trial</strong></h4>\n              <p>If your case goes to trial, Summit Defense clients have the benefit of a <strong>team of litigators </strong>working together with access to the best experts, investigators, and research tools available. We are proud to say that we recently won one of the most difficult trials possible – a double murder trial.</p>\n              <p> </p>\n              <h4><strong>Sentencing</strong></h4>\n              <p>Of course, sentencing is only of concern if you are actually convicted of an offense, and we always do everything possible to avoid a conviction in your case.</p>\n              <p> </p>\n              <p>Apart from the nature of the offense itself and any criminal history, in all cases the judge will consider the specific circumstances of each case before passing sentence. Some of the things that the judge will consider are known as <strong>aggravating and mitigating circumstances</strong> – these are factors that might either increase (aggravate) or decrease (mitigate) the eventual sentence. Summit Defense Attorneys know how to put together a positive case on sentencing that brings together as many mitigating circumstances as possible, and reduces the negative effect of any aggravating circumstances.</p>\n              <p> </p>\n              <p>The outcome of your case will depend on many factors, some of which you now have no control over. However, one of the biggest factors that will influence the outcome of your case is the law firm that you choose.</p>\n              <p> </p>\n              <h2>WHAT IS INVOLVED IN THE INITIAL CASE REVIEW?</h2>\n              <p>A Summit Defense attorney will meet with you or schedule a phone consultation to discuss your case in detail. Each client and criminal accusation is unique, so your attorney will ask many questions to advise you about your best defense strategy.</p>\n              <p> </p>\n              <p>Our goal is always to work to have your <strong><em>charges completely dismissed.</em></strong></p>\n              <p> </p>\n              <h2>WHAT SHOULD I ASK MY SUMMIT DEFENSE ATTORNEY?</h2>\n              <ul role=\"list\">\n                <li>How serious is my charge?</li>\n                <li>How strong is the case against me?</li>\n                <li>What will Summit Defense’s strategy be?</li>\n                <li>If I’m found guilty, what is the likely outcome?</li>\n                <li>How long will this case take to resolve?</li>\n                <li>Will I lose my job?</li>\n                <li>Are there any immigration status problems?</li>\n                <li>How much will this cost?</li>\n              </ul>\n              <p> </p>\n              <h2>SHOULD I BRING ANYTHING WITH ME?</h2>\n              <p>Please bring any records related to your case. If you feel that you’d be more comfortable with a family member present, ask us first. All meetings are completely confidential.</p>\n              <p> </p>\n              <h2>WHERE WILL IT TAKE PLACE?</h2>\n              <p>Summit Defense has eight <a href=\"https://www.summitdefense.com/firm-locations/\">offices</a> located throughout the Bay Area. We offer after-hours and weekend appointments. If our locations are not convenient for you, one of our attorneys may be able to meet you at your home or another convenient location.</p>\n              <p> </p>\n              <h2>IS THERE ANY FINANCIAL OBLIGATION?</h2>\n              <p>No, the case review is <strong><em>completely free of charge</em></strong><em>. </em>It gives us both an opportunity to meet each other and decide whether we’d like to work together.</p>\n              <h2>‍</h2>\n            "},"iframe":{}}