{"img":{"i68e6c9de":{"src":"/assets/images/alison-minet-adams_1.jpg","alt":"","sizes":""},"in555f2e74":{"src":"/assets/images/group-229.png","alt":"","sizes":""},"in556d45f5":{"src":"/assets/images/group-228.png","alt":"","sizes":""}},"link":{"a23":"#","a687adf83":"#awards-recognition","a-5e312cd7":"#awards-memberships","a54b5dee5":"#education"},"text":{"tn32f23a25":"attorney Alison Minet Adams","t2268ff":"Home","t6e7c0dcd":"\n            <a href=\"/\" class=\"breadcrumb-links\" data-text=\"t2268ff\">Home</a> » Attorney Alison Minet Adams\n          ","t139d1559":"Alison Minet Adams","tn2bf5a469":"ATTORNEY AT LAW","tde61999":"About Alison ","t62cbcdd3":"Awards &amp; Recognition","tn63e03e87":"Awards &amp; Memberships","t661d8788":"Education","t5a0ea5a1":"Thank you! Your submission has been received!","tn7c112e99":"Oops! Something went wrong while submitting the form.","tn5d145245":"Attorney Alison Minet Adams","tn7d6c0869":"Attorney At Law","t1fb94654":"Passionate about her Work","t2898d22f":"I am passionate about the work that we do. We have to keep fighting to protect our clients’ constitutional rights against those who would like to take them away.","tn7fa403d4":"- Alison Minet Adams","tn3c39786f":"Medical Marijuana Law","t4d435084":"Awards and Recognition","tn5dd86c33":"Alison Adams is an outstanding attorney in so many areas. She thoroughly understands criminal law, civil litigation, and appeals. Call her before you decide on which lawyer to hire. She will hear you out and give you great advice.","t5c78e965":"– <a href=\"http://www.avvo.com/attorneys/91604-ca-alison-adams-94073/endorsements.html\" target=\"_blank\" class=\"link-atty\">Peer Endorsement by criminal attorney Zachary McCready</a>\n                  ","t5fb40d58":"Peer Endorsement by criminal attorney Zachary McCready","t15460d41":"Member, Michigan and Florida Bar","t7cf54d23":"Longtime board member of the Anti-Defamation League","tn1cf44146":"Former President, Michigan Association for Justice","t2bfc5801":"Past Chair-Negligence Section of the State Bar of Michigan","t50ca5822":"Member, Democratic National Committee","t4c74a00f":"Officer, Michigan Democratic Party","tn2371a788":"Champion of Justice Award, MAJ","tn7bc391c0":"Wings of Justice Award, Oakland County Democratic Party","tn6b3c8878":"EDUCATION","t2e047c34":"Stetson University College of Law, J.D., 1977","t1b712dba":"Bradley University, 1974"},"textarea":{"ta170f068d":"Request a Free <br>Consultation","ta13962720":"Widely recognized and admired in the legal community <strong>for over 30 years</strong> for her success in <strong>criminal appeals law and post conviction in California and Federal Courts</strong>, Alison Minet Adams has <strong>won cases at all levels including in both the California and US Supreme Courts</strong>.<br><br>Clients who retain Summit Defense benefit by hiring a team of attorneys who have expertise at every stage of a criminal case. &nbsp;The team includes attorneys who focus on pre-file strategies to avoid prosecution, to those who are experts at trial, to Ms. Adams who is Summit Defense’s expert when an appeal is required.<br><br>Those clients who work with Ms. Adams benefit from a senior attorney who’s skill and experience places her amongst a very select &nbsp;group of California attorneys who are accredited as a <strong>Certified Appellate Specialist</strong>. &nbsp;This accreditation is only awarded to attorneys who have a high level of experience and have passed a rigorous specialization exam.Widely recognized and admired in the legal community","ta587c5057":"When asked about what inspired her to become a <strong>criminal appeals attorney</strong>, Alison explained that her favorite show growing up was Perry Mason – a show about a criminal defense attorney who would only accept cases that he considered to be unusual, difficult or nearly-hopeless.<br><br>Years later, in law school, Alison had the opportunity to attend a criminal law class taught by the famous Judge Arthur Alarcon, who was the first Latino appointed to the 9th Circuit Court and presided over the trial of Robert F. Kennedy’s assassin. &nbsp;Judge Alarcon inspired Alison to pursue a career in criminal appeals where she could, like Perry Mason, beat the odds in cases that on the face appeared to be nearly-hopeless.<br>","tane0bf421":"Most recently Ms. Adams has argued and won cases representing collectives in <strong>California medical marijuana law. </strong>\n              <a href=\"http://caselaw.findlaw.com/ca-court-of-appeal/1623476.html\" target=\"_blank\"><strong>People Ex Rel City of Dana Point v. Holistic Health</strong><br><br>‍</a>She believes with all her heart that qualified medical cannabis patients should have unimpeded access and has become a leading practitioner in that fast changing field.<br>‍<a href=\"http://caselaw.findlaw.com/ca-court-of-appeal/1623476.html\" target=\"_blank\"><br></a>Part of Ms. Adams’ practice includes <strong>legal evaluation of medical marijuana collectives</strong> to insure that they are in compliance with all applicable laws and regulations. &nbsp;<br>‍<br>In medical marijuana law, Ms. Adams was named the <strong>Appellate Attorney of the Year.</strong>\n            ","ta443c1a4f":"<strong>People Ex Rel City of Dana Point v. Holistic Health</strong><br><br>‍","ta3fbe8166":"<br>","ta1cfdb6e9":"Ms. Adams has been repeatedly named as &nbsp;a <strong>Superlawyer</strong> by California Superlawyers magazine and she has twice won the <strong>annual appellate lawyer excellence award</strong> from the Private Defenders Association of California. &nbsp;She has also achieved a <strong>superb rating</strong> by the Avvo lawyers directory and an award issued by Martindale-Hubble for <strong>Very High rating in both Legal Ability and Ethical Standards.<br><br>‍</strong>Ms. Adams earned her undergraduate degree at Tufts University and her law degree at Loyola Law School.","ta7443021a":"Very High rating in both Legal Ability and Ethical Standards.<br><br>‍","tan4de1fb43":"Michigan<br><em>Super Lawyers®</em> (2008-Present)"},"richtext":{},"iframe":{}}