{"img":{"in8782bbc":{"src":"/assets/images/polygon-6.png","alt":"","sizes":""},"ic8a39f4":{"src":"/assets/images/image.jpg","alt":"","srcset":["/assets/images/image-p-500.jpeg 500w","/assets/images/image.jpg 694w"],"sizes":"(max-width: 767px) 90vw, (max-width: 991px) 87vw, (max-width: 1279px) 85vw, (max-width: 1439px) 83vw, (max-width: 1919px) 1087px, 1460px"},"i4b82d9af":{"src":"/assets/images/group-228-1.png","alt":"","sizes":""}},"link":{"a-6d0c139":"tel:(916)830-0061","a-3e135f89":"https://www.google.com/maps/dir//Bank+of+the+West+Tower+500+Capitol+Mall+Sacramento,+CA+95814/@38.577961,-121.5015358,15z/data=!4m8!4m7!1m0!1m5!1m1!1s0x809ad12de046976f:0x59c56b732063537a!2m2!1d-121.5015358!2d38.577961","a23":"#"},"text":{"tn69316251":"SACRAMENTO OFFICE","t5d95b674":"Phone: (916) 830-0061","t6be30b0d":"Driving Directions","t2268ff":"Home","tn35c7e568":"\n            <a href=\"/\" class=\"breadcrumb-links\" data-text=\"t2268ff\">Home</a> » <a href=\"firm-locations\" class=\"breadcrumb-links\">Locations </a>» Sacramento\n          ","tn2d478f5e":"Locations ","t38870671":"720 9th St, Sacramento, CA 95814","t30f1082b":"501 I St # 4200, Sacramento, CA 95814","t461d27e2":"9605 Kiefer Blvd, Sacramento, CA 95827","tn252da699":"501 I St # 4200Sacramento, CA95814","tn4ebb0c7c":"related links","tn504fbad8":"Sex Crime - Sacramento"},"textarea":{"tanaf51c1b":"<br>SACRAMENTO CRIMINAL DEFENSE ATTORNEY<br>‍<strong><br></strong>","ta3fbe8166":"<br>","tan2f8f3380":"If you’ve been accused of a misdemeanor or a serious felony in Sacramento, a criminal defense attorney can help. At Summit Defense, our goal is always the complete dismissal of all charges. If this isn’t possible, we often negotiate solutions for our clients that allow them to avoid jail and sometimes even prosecution.<br>","tan348524a7":"<strong class=\"bold-text-18\">Summit Defense</strong><br><strong class=\"bold-text-18\">‍</strong>500 Capitol Mall Sacramento, CA 95814","tan188d4933":"SACRAMENTO CRIMINAL COURT INFORMATION<br>","tan7ae0cfc8":"<strong>SACRAMENTO COUNTY COURTHOUSE</strong>","ta71f621cc":"Phone: <br>‍<a href=\"tel:(916)874-5522\" class=\"link-9\">(916) 874-5522</a>\n                ","ta7af037b5":"<strong>SACRAMENTO FEDERAL COURT</strong>","ta261f2131":"Phone: <br>‍<a href=\"tel:(916)930-4000\" class=\"link-9\">(916) 930-4000</a>\n                ","ta171acb6c":"<strong>SACRAMENTO JUVENILE COURT</strong>","ta1c5ff370":"Phone: <br>‍<a href=\"tel:(916)876-7753\" class=\"link-9\">(916) 876-7753</a>\n                ","ta181f4981":"JAILS IN SACRAMENTO<br>","ta6a7a2f01":"HOW DO I VISIT SOMEONE IN JAIL IN SACRAMENTO?<br>","ta13a05f86":"federal court locations<br>","tane649f95":"<strong>Sacramento Federal Courthouse</strong>"},"richtext":{"rn4a99d109":"\n              <h3>CONTACT A TEAM OF EXPERIENCED SACRAMENTO CRIMINAL DEFENSE ATTORNEYS TODAY</h3>\n              <p>There’s no denying that being arrested for a crime is a rather alarming experience, and even temporarily having your freedoms taken away will make you want high-quality legal advice. If you’ve been arrested for any sort of crime in the Sacramento area, then you’re going to need to hire an experienced Sacramento criminal defense attorney to have your charges reduced or avoid jail time.</p>\n              <p>Summit Defense is a top criminal defense law firm based in Northern California that has supported countless individuals facing criminal offenses, and our legal services will support you through both state and federal courts as we do whatever is necessary to clear your criminal record to the fullest extent within the parameters of criminal defense law.</p>\n              <p>\n                <a href=\"https://www.summitdefense.com/attorneys/\" target=\"_blank\">Our law office</a> is always here for you or your loved one as you’re going through these stressful criminal law proceedings, and below we’ll be detailing a comprehensive overview oriented around everything you need to know about how we’ll perform our duties as your criminal defense lawyer.\n              </p>\n              <p>\n                <a href=\"https://www.summitdefense.com/contact/\" target=\"_blank\">Contact us online</a> or call us at 1-866-903-3141 to get in touch with a defense attorney today during your free consultation.\n              </p>\n              <h3>SACRAMENTO CRIMINAL CASES OUR DEFENSE LAW FIRM HANDLES</h3>\n              <p>Our criminal defense lawyers in Sacramento CA provide all sorts of legal representation oriented within criminal defense law, and some of the more common <a href=\"https://www.summitdefense.com/crimes-we-defend/\" target=\"_blank\">crimes we defend</a> include the following criminal offenses:</p>\n              <ul role=\"list\">\n                <li>Drug crimes</li>\n                <li>Domestic violence</li>\n                <li>Federal crimes</li>\n                <li>Drug possession</li>\n                <li>Sexual offenses</li>\n                <li>Serious felonies</li>\n                <li>White collar crimes</li>\n                <li>DUI cases</li>\n                <li>Fraud</li>\n                <li>Animal abuse</li>\n                <li>Assaults</li>\n                <li>Child molestation/pornography</li>\n                <li>Battery on a police officer/Battery that causes bodily injury</li>\n                <li>Grand theft</li>\n                <li>Hit and run</li>\n                <li>Marijuana law</li>\n                <li>Indecent exposure</li>\n                <li>Probation violation</li>\n                <li>Resisting arrest</li>\n                <li>Rape</li>\n                <li>Registration of sex offenders</li>\n                <li>Professional and small business licensing</li>\n                <li>And much, much more…</li>\n              </ul>\n              <p>Our experienced legal team and criminal defense attorneys will support you throughout any criminal investigations conducted by law enforcement, and you can rest assured of our law firm’s <a href=\"https://www.summitdefense.com/case-results/\" target=\"_blank\">past success</a> within a whole array of criminal cases. We practice law to support individuals in need of legal services, and we’ll guide you through a plea agreement and do whatever is necessary to have your charges reduced when it’s an appropriate strategy.</p>\n              <p>And when it’s viable, we’ll do whatever it takes to have your case dismissed!</p>\n              <h3>WHAT YOUR SACRAMENTO CRIMINAL LAWYER WILL DO FOR YOU</h3>\n              <p>Your Sacramento criminal defense lawyer will work tirelessly to keep you or your loved one out of jail, and our defense attorneys will also ensure that your legal rights are fully upheld and not violated. We understand how our legal representation can be the difference between winning and losing a criminal case, so we’ll fight for you to ensure that you avoid jail and at the very least have your charges reduced.</p>\n              <p>Below is a comprehensive list oriented around what our Sacramento criminal defense attorneys will do for you or your loved one:</p>\n              <ul role=\"list\">\n                <li>Fully investigate your criminal case starting during your free consultation. This will include obtaining all relevant evidence, collecting police reports, interviewing witnesses, and collecting other forms of evidence like <a href=\"https://www.legalzoom.com/articles/what-is-an-affidavit-and-how-is-it-used\" target=\"_blank\">affidavits</a> from a former police officer.</li>\n                <li>Utilize all of the collected evidence to develop your best course for legal action, dependent upon your unique circumstances.</li>\n                <li>We’ll then discuss your criminal case directly with you and your family to get your input when it comes to things like negotiating a plea agreement with Sacramento CA prosecutors or formulating a plan for jury trials. This legal advice will ultimately formulate your overall legal strategy, and it’s an important step within the attorney-client relationship.</li>\n                <li>Your defense attorney will continue to provide you with legal advice as we participate in criminal investigations and your preliminary hearing. Our law offices are full of super lawyers that can potentially get your case dismissed or your charges reduced early on within these stages of the criminal law process, and our specialists will be there for you through every step no matter what is necessary for your unique scenario.</li>\n                <li>Your criminal attorney will also do whatever is necessary to have unfair/damaging evidence thrown out, which is more common in Northern California than most people facing a criminal offense would assume.</li>\n                <li>Your Sacramento criminal defense attorney will also support you through plea agreement negotiations with a police officer or local prosecutor, which can reduce your criminal charges and potentially leave you with a minor penalty like community service instead of jail time.</li>\n                <li>When you’re innocent of the crimes you’ve been accused of, we’ll be there for you to defend you throughout jury trials and get your case dismissed.</li>\n              </ul>\n              <h3>WHAT SHOULD I LOOK FOR WHEN HIRING A CRIMINAL DEFENSE ATTORNEY?</h3>\n              <p>There of course are many different factors that you should look for when you’re in the process of hiring a criminal defense law firm in Sacramento CA, and some of the most important considerations to keep in mind include the following:</p>\n              <ul role=\"list\">\n                <li><strong>Location:</strong> Your defense attorney should be licensed in California and have experience helping past clients in the Northern California and Sacramento area.</li>\n                <li><strong>Legal Concentration:</strong> Although there are countless criminal defense lawyers that take on a whole variety of criminal charges, there are many that specialize within specific niches of criminal defense law. These legal concentrations can include things like DUI cases, felony cases, white-collar crimes, sexual offenses, and much more. It’s always a good idea to work with a legal team that specifically concentrates on the charges that you or your loved one is currently facing because it will be a clear indication that they have the necessary amount of experience to provide you with a favorable outcome.</li>\n                <li><strong>Personal/Firm Qualities:</strong> There are many unique qualities found within every criminal defense law firm, so it’ll ultimately be up to you in terms of what type of law office you feel most comfortable hiring for your legal services. What’s great about working with Summit Defense is that we’re not too big and we’re not too small, and our team of criminal law experts will be able to provide your case with the attention it undoubtedly deserves.</li>\n                <li><strong>Reputation:</strong> The reputation of a criminal defense lawyer or law firm is always a serious consideration. You can check out our <a href=\"https://www.summitdefense.com/reviews/\" target=\"_blank\">client reviews</a> to get a better glimpse into what our past clients have said about us, and you can also go through the many <a href=\"https://www.yelp.com/biz/summit-defense-san-jose-3\" target=\"_blank\">Yelp reviews</a> that we’ve accrued over the years.</li>\n                <li><strong>Legal Fees:</strong> The overall cost of your private attorney is of course a major aspect of any attorney-client relationship, and you should always make sure that your expenses are 100% transparent and that you ultimately know what you’re going to pay. Attorney fees can vary depending upon a whole variety of factors, so working with a law office that maintains transparency in terms of legal fees is always a big thing to be on the lookout for.</li>\n                <li><strong>Private Attorney or Public Defender:</strong> There are certain situations in which an eligible individual will be granted access to a public defender, but it’s really important to understand that these government officials are extremely busy in the Sacramento area and all of California, and they’ll likely not provide your case with the attention that it needs. Hiring a private attorney from Summit Defense will provide you with the expertise and attention to detail to obtain your most favorable outcome.</li>\n              </ul>\n              <h3>WHAT TO DO AFTER A SACRAMENTO COUNTY ARREST</h3>\n              <p>Below we’ll be going over a few important tips to keep in mind in the moments after your arrest in Sacramento, California. These tips are really important for a whole variety of reasons, and in general, it’s crucial to understand how aggressive/disrespectful actions towards a police officer will only complicate the police report and make matters worse for you.</p>\n              <p>Inappropriate behavior after an arrest can potentially lead to more criminal charges, so your best strategy is always to be patient and calm and have a criminal lawyer in your contacts that you can call as soon as possible.</p>\n              <h3>REMAIN QUIET</h3>\n              <p>Being quiet is one of the most important things you can do during an arrest, and it’s simply important to remember that you’re never going to talk your way out of these situations. What you say can be used against you in a court of law, so being quiet is your best strategy towards not complicating your case.</p>\n              <p>Once you’ve been transported to a jail or police station, you can then call your criminal defense lawyer. The Summit Defense legal team will then take over from this moment and properly ensure that everything is done to obtain your best legal outcome.</p>\n              <h3>CALL EXPERIENCED SACRAMENTO CRIMINAL DEFENSE LAWYERS</h3>\n              <p>Once you’ve reached out to your Sacramento criminal defense attorneys, they’ll advise you on how you should approach the next steps of your legal proceedings. If bail is possible for your criminal charge, your legal team will help you better understand what you can expect from this process.</p>\n              <p>If you must stay in jail until your arraignment, your attorney will help you understand what this timeline will entail and provide you with more strategic information oriented to your unique circumstances. Navigating criminal law towards a favorable outcome is a lot easier said than done, which is why you should always have criminal defense lawyers supporting you as quickly as possible after your arrest.</p>\n              <h3>ONLY SPEAK WITH YOUR LAWYER</h3>\n              <p>Once you have an experienced criminal defense attorney on your side, you should only speak about your alleged crimes and criminal charges with your legal representatives. Criminal charges are always very complicated, no matter if you’re facing serious felonies or a misdemeanor charge.</p>\n              <p>You’re going to need to avoid any inadvertent, incriminating comments made to law enforcement officers and prosecutors; so leaving the talking up to your attorney is your best option no matter what charges you’re dealing with.</p>\n            ","r3c85078b":"\n              <h3>CONTACT OUR SACRAMENTO CRIMINAL DEFENSE LAWYERS FOR A FREE CONFIDENTIAL CONSULTATION</h3>\n              <p>\n                <a href=\"https://www.summitdefense.com/\" target=\"_blank\">Summit Defense</a> has supported countless people throughout Sacramento, San Francisco, and the entire Northern California region when it comes to defending against all sorts of criminal charges.\n              </p>\n              <p>When you or a loved one is in legal trouble, it’ll be absolutely imperative that you hire an experienced Sacramento criminal defense attorney to make these stressful situations much more manageable.</p>\n              <p>\n                <a href=\"https://www.summitdefense.com/contact/\" target=\"_blank\">Contact us online</a> or call us at 1-866-537-2584 to get in touch with our legal team today and schedule your free consultation today.\n              </p>\n            ","r5d6c8946":"\n                <p>There is one main county jail and one correctional facility (Branch jail) in Sacramento.</p>\n                <p>The County Jail is at 651 I St, Sacramento, CA 95814</p>\n                <p>The Branch Jail (<em>otherwise known as Rio Consumnes Correctional Center, or RCCC</em>) is at 12500 Brucevill Road, Elk Grove CA 95757</p>\n              ","r14840a02":"\n                <p>For the Main Jail, visitors must register and sign up for an appointment time. Each inmate is allowed two 45 minute social visits per week.</p>\n                <p>‍</p>\n                <p>For the Branch Jail, visitors must register an hour before and times for visiting are restricted to Saturday and Sunday in blocks of time according to the inmate’s last name.</p>\n                <p>‍</p>\n                <p>For more detailed information, it is best to go the the Sacramento Sheriff’s Department website at <a href=\"https://www.sacsheriff.com/.\">https://www.sacsheriff.com/.</a>\n                </p>\n                <p>‍</p>\n              "},"iframe":{"i-3daddcad":"https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d6238.163866854672!2d-121.50153599999999!3d38.577961!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x809ad12de046976f%3A0x59c56b732063537a!2sBank%20of%20the%20West%20Tower%2C%20500%20Capitol%20Mall%2C%20Sacramento%2C%20CA%2095814!5e0!3m2!1sen!2sus!4v1634121935873!5m2!1sen!2sus"}}