{"img":{"i44aed6a1":{"src":"/assets/images/james-riley.png","alt":"","sizes":""},"in555f2e74":{"src":"/assets/images/group-229.png","alt":"","sizes":""},"in556d45f5":{"src":"/assets/images/group-228.png","alt":"","sizes":""},"i7c64f8f9":{"src":"/assets/images/reillyontv-300x200.png","alt":"","sizes":""}},"link":{"a-4eee8772":"#about-attrney","a-5e312cd7":"#awards-memberships","a54b5dee5":"#education"},"text":{"t4bacf41":"attorney James Reilly","t2268ff":"Home","t227adf27":"\n            <a href=\"/\" class=\"breadcrumb-links\" data-text=\"t2268ff\">Home</a> » Attorney James Reilly\n          ","tn11ceac1":"James Reilly","tn2bf5a469":"ATTORNEY AT LAW","t48f2cab1":"About James","tn63e03e87":"Awards &amp; Memberships","t661d8788":"Education","t5a0ea5a1":"Thank you! Your submission has been received!","tn7c112e99":"Oops! Something went wrong while submitting the form.","t719c1f21":"Attorney James Reilly","tn46d0f489":"Attorney at Law","t6cf6a4d2":"I don’t normally say this, but Mr. Reilly, you are always welcome in this courtroom. &nbsp;I thought you were a consummate professional. &nbsp;You were prepared, you were intelligent. You represented your client perfectly. And you squeezed everything out of this case that you possibly could and I think the defendant is lucky to have you.","tn3bc2e104":"– Santa Clara County Superior Court Judge (April 20, 2011, San Jose)","t3a902107":"FOCUS EXCLUSIVELY ON CRIMINAL DEFENSE","tn1864d98c":"THE ADVANTAGE TO BEING A FORMER PROSECUTOR","tn9d15619":"Criminal Defense attorney with a winning track record who has successfully handled over 100 jury trials and 40 District Court Appeals.","t229bf0ad":"Supervising District Attorney","tn60167f5e":"Cum Laude honors graduate and President of Student Body at Pepperdine Law School","tn4d6233d8":"UC Hastings Law School Instructor","t36b23234":"Honors graduate of the US Military Academy, West Point","tn9b664d7":"Award winning Lieutenant in the United States Navy, Served in Vietnam","t74fb29a8":"TEACHES OTHER ATTORNEYS","tn279033af":"President of the Student Bar Association, Academic Year 1973-74","t17a51555":"Vincent J. Dalsimer Award as the Top Advocate of the 1975 Pepperdine Moot Court Competition","t3949ac2d":"Participant in the 1975 Roger J. Traynor California State Moot Court Competition","tn6b3c8878":"EDUCATION","t431a8dfd":"Graduated from United States Military Academy, West Point, NY, 6-7-67","tn81054b2":"Graduated from Pepperdine University School of Law (then in Anaheim, CA, now in Malibu, CA), 5-24-1975"},"textarea":{"ta170f068d":"Request a Free <br>Consultation","tan7b519c82":"James Reilly sets the standard of excellence at Summit Defense. A former supervising prosecutor and current defense attorney with over 20 years of criminal law experience under his belt, Jim’s accomplishments in the courtroom are respected throughout the Northern California legal community.<br><br>In one case result that Jim is particularly proud of, our client was accused of molesting two children and was facing life in prison. Following a three week trial, Jim hung the jury, persuaded the DA not to refile and ultimately secured a dismissal in the case. Our client is now home with his family. At the conclusion of the trial, the judge made the following remarks on the record about Jim’s defense:","tan48b0c401":"Summit Defense is known for representing Bay Area professionals with first-time offenses such as shoplifting, DUI and Domestic Battery. However, because of Jim’s leadership, Summit Defense is often selected to handle the San Francisco Bay Area’s most difficult and prominent cases. Some of the serious felonies that Summit Defense defended in 2011 include child molestation, first degree murder, embezzlement and federal fraud. In 2011 Summit Defense represented a client accused of running a 20 year long $50 million ponzi scheme. Summit Defense also represented a defendant in the Hewlett Packard pretexting scandal.<br><br>In 2011, Jim Reilly was recognized by Newsweek Magazine as one of the country’s Top 8 Criminal Defense Attorneys nationwide.","ta7a4e3cc0":"Like other former prosecutors at Summit Defense, Jim began his career on the other side – as a prosecutor. Jim believes that his experience as a prosecutor gives him a tremendous advantage over attorneys who have only been on the defense side. James Reilly knows all the tricks. He anticipates prosecutors’ strategies, knows when they are bluffing, and then pushes for a better outcome-including winning at trial.<br><br>Jim is one of those rare individuals who is a success at everything he does.","tan85eeee4":"Jim’s skills as a teacher were refined over the years. As a young prosecutor, he rose through the ranks to become a supervising DA, where he mentored young DAs. He was also a law school instructor at UC Hastings School of Law in San Francisco.<br><br>As a respected defense attorney, he is often asked to lead seminars or comment on the news. Jim recently taught a seminar to San Jose defense attorneys explaining how to properly defend DUI cases. He has been interviewed on San Francisco’s KRON channel 4 numerous times commenting about Northern California legal developments. He was also recently featured as a panel expert on a San Jose news program called","tan1d7a5d3":"<strong>Years in Practice: </strong>41 years (admitted 12-18-75; &nbsp;began working as a DDA in Orange County January 1976)","ta2e3093ce":"<strong>Pepperdine University School of Law:</strong>Graduated cum laude, 3rd in classDean’s Honor Roll every semester","tan60ce2df9":"Earned five <strong>American Jurisprudence</strong> awards, first in my class in:TortsContractsConstitutional LawConflict of LawsLabor Law"},"richtext":{},"iframe":{}}