{"img":{"in720e482e":{"src":"/assets/images/rabin-nabizadeh.png","alt":"","sizes":""},"in555f2e74":{"src":"/assets/images/group-229.png","alt":"","sizes":""},"in556d45f5":{"src":"/assets/images/group-228.png","alt":"","sizes":""}},"link":{"a23":"#","a-5e312cd7":"#awards-memberships","a54b5dee5":"#education"},"text":{"t454eef7c":"Attorney Rabin Nabizadeh","t2268ff":"Home","td6f7870":"\n            <a href=\"/\" class=\"breadcrumb-links\" data-text=\"t2268ff\">Home</a> » Attorney Rabin Nabizadeh\n          ","tn25d62362":"Rabin Nabizadeh","tn2bf5a469":"ATTORNEY AT LAW","t49635de5":"About Rabin","tn63e03e87":"Awards &amp; Memberships","t661d8788":"Education","t5a0ea5a1":"Thank you! Your submission has been received!","tn7c112e99":"Oops! Something went wrong while submitting the form.","tn41fec049":"attorney At Law","t364ecc36":"Rabin is an excellent attorney who was able to get my case dropped completely! He was always there to answer any questions I had, even though I'm pretty sure I asked the same questions a few times. If I know anyone who is arrested and charged with a crime, I will immediately refer them to Summit Defense. Thank you again to Rabin, Robert, and the entire Summit Defense team!","t3cabd377":" - Melanie D., Hercules CA","t6fdc33c0":"One unique strength that Mr. Nabizadeh brings to the Summit Defense team is his understanding of Immigration Law and its potential impacts on his client’s cases. Many clients come to him with multi-faceted problems that have both criminal and immigration consequences. If, for instance a client is planning to apply for citizenship, Rabin understands that certain approaches make more sense.","t332541bd":"In the News","tn1fcf991":"Mr. Nabizadeh is frequently asked for his opinion regarding legal issues. He was recently asked to comment on drone surveillance law.","t9fee7d7":"Outstanding Law Student","tn518c3375":"Recent Case Results","tn4f4511aa":"Years in practice 13","tn63f27e8f":"School UC Hastings College of the Law 2003 — Best Oral Advocate – Moot Court","t967e64":"Member – CPDA, Alameda County Bar Association","t5d9369b2":"Education:","t838dab5":"Undergraduate – BA Philosphy ","tn3241389a":"UCLA 1996 Dean’s List honorable mention"},"textarea":{"ta170f068d":"Request a Free <br>Consultation","ta6bea8d7c":"Mr. Rabin Nabizadeh is a staunch, single minded advocate with years of experience and a proven track record in both Federal and State courts. He has represented individuals in cases ranging from Misdemeanor DUI, Theft and Domestic Violence cases to serious felonies including Grand Theft, Burglary, Sex Crimes and even Murder. While defending these clients, Mr. Nabizadeh achieved the remarkable success that Summit Defense demands from their attorneys.<br>","tan67edca2":"Rabin prepared for his law career at UCLA, where he placed on the Dean’s List. Next he attended the top U.C. Hastings College of the Law, when he won an award as the Best Oral Advocate in the Moot Court competition.<br><br>Mr. Nabizadeh has mentored with nationally renowned attorneys who quickly recognized his passion, quick wit and unrelenting drive to protect those accused by an often unforgiving criminal justice system.<br><br>Mr. Nabizadeh is fluent in Hebrew as well as Farsi and loves to play classical guitar in his spare time.<br>\n              <a href=\"http://www.ktvu.com/news/200301577-story\" target=\"_blank\"></a>\n            ","ta183db7e9":"CHARGES Client charged with possession with intent to sell.<br>RESULT <strong>Acquitted at trial.<br><br>‍</strong>CHARGES Client charged with 6 counts of felony burglary with allegation of prior strike.<br>RESULT <strong>No Jail – Probation and 60 days of Cal-trans.<br><br>‍</strong>CHARGES Client charged with felony sexual assault.<br>RESULT <strong>Several counts dismissed at preliminary hearing and charge reduced to misdemeanor false imprisonment requiring no jail – only probation and community service.<br><br>‍</strong>CHARGES Client charged with felony resisting arrest.<br>RESULT <strong>Reduced an Infraction with no probation.<br><br>‍</strong>CHARGES Client charged with felony grand theft.<br>RESULT <strong>Reduced to a misdemeanor with time served.<br><br>‍</strong>\n              <a href=\"http://www.ktvu.com/news/200301577-story\" target=\"_blank\">http://www.ktvu.com/news/200301577-story</a>\n            ","tan3cc4edba":"Acquitted at trial.<br><br>‍","tan4ce6d2e1":"No Jail – Probation and 60 days of Cal-trans.<br><br>‍","ta721eab4":"Several counts dismissed at preliminary hearing and charge reduced to misdemeanor false imprisonment requiring no jail – only probation and community service.<br><br>‍","tanaec97ee":"Reduced an Infraction with no probation.<br><br>‍","ta3a65db6f":"Reduced to a misdemeanor with time served.<br><br>‍"},"richtext":{},"iframe":{"i9c27fc6":"https://www.youtube.com/embed/Rl0tm7q3m3g?rel=0&controls=1&autoplay=0&mute=0&start=0"}}