{"img":{"in8782bbc":{"src":"/assets/images/polygon-6.png","alt":"","sizes":""},"ic8a39f4":{"src":"/assets/images/image.jpg","alt":"","srcset":["/assets/images/image-p-500.jpeg 500w","/assets/images/image.jpg 694w"],"sizes":"(max-width: 767px) 90vw, (max-width: 991px) 87vw, (max-width: 1279px) 85vw, (max-width: 1439px) 83vw, (max-width: 1919px) 1087px, 1460px"},"i969ffa0":{"src":"/assets/images/arrow-left.png","alt":"","sizes":""},"i519f0e04":{"src":"/assets/images/arrow-left-1.png","alt":"","sizes":""},"in319d2851":{"src":"/assets/images/left-quote-1.png","alt":"","sizes":""}},"link":{"a78ba7bb6":"tel:(415)524-7717","a5112a845":"https://www.google.com/maps/dir//Summit+Defense+4040+Civic+Center+Dr+%23200+San+Rafael,+CA+94903+United+States/@38.0060496,-122.5380794,13z/data=!4m8!4m7!1m0!1m5!1m1!1s0x80859780b83e3b73:0x7b24b7b8d25439a1!2m2!1d-122.5380794!2d38.0060496"},"text":{"t15ce680b":"SAN RAFAEL OFFICE","tne18f1f5":"Phone :(415) 524-7717","t6be30b0d":"Driving Directions","t2268ff":"Home","t2ddb52f4":"\n            <a href=\"/\" class=\"breadcrumb-links\" data-text=\"t2268ff\">Home</a> » <a href=\"firm-locations\" class=\"breadcrumb-links\">Locations </a>» San Rafael\n          ","tn2d478f5e":"Locations ","t3c27cef1":"Court Information for San Rafael","t392ccf55":"Marin County Superior Court","tn5b452cc9":"3501 Civic Center Drive, San Rafael","tn2a87c4c":"JAIL INFORMATION FOR SAN RAFAEL/MARIN COUNTY","tn18068c0d":"Marin County Jail","t45efe7dd":"Driving Directions to Summit Defense in San Rafael, CA","t11cf941c":"Get on Highway 101 driving South. Stay on 101 for about seven miles, passing the Bel Marin Keys and Ignacio Valley Preserve on your way. Take exit 455 toward Terra Linda. You’ll pass the Four Points Sheraton as you exit the Highway. Take the first left onto Manuel T Fritas Pkwy, going under Highway 101. Continue Straight on Manuel T Fritas Pkwy and up the hill. Our office is by Café 4040.","t56095544":"Begin driving East on Sir Francis Drake Blvd, passing through Gary Giacomini Open Space Preserve. After 2 miles, take a left onto Nicasio Valley Rd. After 4 miles, turn right onto Lucas Valley Rd. before reaching Lucas Valley proper. Follow this road for 17 miles, passing Bull Tail Valley, Terra Linda-Sleepy Hollow Divide, and Marin Waldorf School before reaching Redwood Hwy. Merge onto Redwood Hwy going South for just under a mile. Take exit 455 and take a quick right onto Manuel T Freitas Pkwy, following this to our office.","tn73569ee8":"Successful Case Results in San rafael","tn29ad6270":"Client had two strike","tn55f974a3":"Domestic Violence","tn40dcee31":"Charges possession of child pornography","t53add811":"I can’t imagine where I would be had it not been for Collin Moore. &nbsp;He is an amazing attorney and just an all around great man. &nbsp;Very Happy with the result.","tn7492b039":"Novato","tnec0ef28":"Where do I even begin to describe Mr. Reilly? &nbsp;The most honest, thorough and knowledgeable person I had ever met. &nbsp;They don’t make them like this anymore.","tn57a01fbb":" never imagined anyone would believe how I came to be found with hundreds of child porn, that I was trying to download a game patch and ended up with a virus and unable to remove these videos. &nbsp;It took two years and relentless work from this team to convince the District Attorney that I was, in fact, innocent. &nbsp;I owe my life to this firm. ","tn7027441d":"Mill Valley","t6babdc05":"As a journalist, I was terrified of a conviction for domestic violence and interviewed many attorneys before hiring Summit Defense. &nbsp;Attorney Collin Moore was able to convince the District Attorney not to press charges and even managed to get my record sealed. &nbsp;It is now as if the arrest did not happen. ","t6581fa8d":"Sausalito"},"textarea":{"ta69c4256c":"San Rafael Criminal Defense Attorney<strong><br></strong>","ta3fbe8166":"<br>","ta4e723065":"DUI &amp; DOMESTIC VIOLENCE LAWYERS IN SAN MATEO COUNTY<strong><br></strong>","ta2eeb46bf":"<strong class=\"bold-text-18\">Summit Defense</strong><br>4040 Civic Center Dr #200, San Rafael, CA 94903","tan6d8c2b66":"<strong>Cases Handled:</strong> All criminal and traffic matters<br><strong>Criminal Court Calendar: </strong>\n                  <a href=\"http://apps.marincounty.org/CourtCalendar/\" target=\"_blank\">Marin County Superior Court’s Calendar</a>\n                ","ta4a01beb3":"Phone:<br>\n                  <a href=\"tel:(415)444-7000\" class=\"link-9\">(415) 444-7000</a>\n                ","ta482244d7":"this is the only jail for Marin County and where all San Rafael inmates – male and female – are booked, processed, and held.<br><br>‍<strong>Visiting Schedule:</strong>\n                  <a href=\"https://www.marinsheriff.org/services/faq#section-custody-division\">Marin County Jail Visiting Information</a>\n                ","taaacd40b":"<strong>From North (Novato)</strong><br>","ta1a86e45":"<strong>From South (Mill Valley)</strong><br>","tan36c48849":"Get on Highway 101 N for 8 miles, passing Corte Madera Marsh State Marine Park, San Quentin State Prison, and Boyd Memorial Park. After passing through the heart of San Rafael, take exit 455, close to Lagoon Park. Once off the freeway, take the first right and drive up the hill. You’ll pass Dermatology Consultants-Marin on your way up. Our office is in the same building as Car Q and Smarty Ants Inc.<br>","tan258cd892":"From West (Lagunitas)<br>","tan4e74b010":"<strong>Client</strong>: Chris A<br><strong>Location</strong>: San Rafael<br><strong>Attorneys</strong>: Rabin Nabizadeh, Collin Moore<br><strong>Charge(s):</strong> Client had two strike priors for a case in Los Angeles. He had continued to abuse drugs and was given a “last chance” or he would face the maximum penalty (9 years in state prison). Chris violated probation by failing to report and testing positive. Both probation department and District Attorney demanded the full nine year sentence and the judge agreed. We set the matter over for a probation hearing.<br>‍<br><strong><em>Result</em></strong><em>: After a lengthy hearing, the court agreed to allow client a chance at a residential facility.</em>","tan6e4d4bc3":"<em>Result</em>","tan7933170":"<strong>Client:</strong> Spencer R<br><strong>Location:</strong> San Rafael<br><strong>Attorneys:</strong> Rabin Nabizadeh, Collin Moore<br><strong>Charge(s):</strong> Domestic Violence<br><br>‍<strong><em>Result: </em></strong><em>Mr. Moore was able to convince the District Attorney that despite a confession and injuries, the case should be dismissed given the victim’s past credibility issues.</em>","tan10295fdd":"<em>Result: </em>","ta2803b2d3":"<strong>Client</strong>: Fahim K.<br><strong>Location</strong>: San Rafael<br><strong>Attorney</strong>: Rabin Nabizadeh<br>Charge(s): Charges possession of child pornography<br><br>Client, an immigrant, was charged with possession of hundreds of images and video containing child pornography and was facing 9 years in state prison and deportation. We retained a forensic expert and were able to show that the images could have been left added due to glitch in Bit Torrent-file sharing software and that this was corroborated by several on-line complaints by users.<br>‍<br><strong><em>Result</em></strong><em>: immigration safe plea to misdemeanor. No sex offender registration.</em>","tan4febd617":"Client <span class=\"header-spanv\">Testimonials</span>","ta1b11ee9a":"Real People. <span class=\"header-spanv\">Real Stories.</span>","tan113e57aa":"<strong>Timothy J.</strong>","tan79820fd5":"<strong>Alvaro P.</strong>","tan687a2280":"<em>Collin Moore pulled off a miracle. We had all given hope given the judge saying he would sent my brother to 9 years in prison over and over. We hired Collin because he was recommended by a friend who is a lawyer. Collin got all the files from los angeles and convinced the judge to give my brother probation and drug treatment. Amazing lawyer</em>","ta3a64041e":"<strong>Stephan G.</strong>","tan7492b039":"Novato<br>","tan290b4e91":"From the start, these guys were confident and calm and the most affordable quote I got. Collin Moore answered all my calls and was a beast during the DMV hearing. It felt like his was defending his own child…<br><br>I did a lot of research before hiring this firm and I am so happy I picked them. No dui on my record and no suspension of license.","ta471e7c1e":"<strong>Vicky R.</strong>","ta32ba8dd1":"San Rafael<br>","tan545bb83d":"<strong>Victor D.</strong>","ta57c3194c":"<strong>Victoria C.</strong>"},"richtext":{"r52db2fb":"\n              <h3>Accused of a Criminal Offense? Contact a San Rafael Criminal Defense Attorney.</h3>\n              <p>Summit Defense is Marin County’s premier criminal defense firm. We handle felony and misdemeanor charges arising any where in Marin county including, San Rafael, Novato, Sausalito, Tiburon, Mill Valley and Sausalito.</p>\n            "},"iframe":{"i19827734":"https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d25150.08279202769!2d-122.538079!3d38.00605!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x0%3A0x7b24b7b8d25439a1!2sSummit%20Defense!5e0!3m2!1sen!2shr!4v1634114674925!5m2!1sen!2shr"}}