{"img":{"i5d8a7883":{"src":"/assets/images/collin-moore_1.jpg","alt":"","sizes":""},"in555f2e74":{"src":"/assets/images/group-229.png","alt":"","sizes":""},"in556d45f5":{"src":"/assets/images/group-228.png","alt":"","sizes":""}},"link":{"a23":"#","a-7286579d":"#academic-excellence","a-5e312cd7":"#awards-memberships","a54b5dee5":"#education"},"text":{"t32908813":"Attorney Collin Moore","t2268ff":"Home","t7223caf5":"\n            <a href=\"/\" class=\"breadcrumb-links\" data-text=\"t2268ff\">Home</a> » Attorney Collin Moore\n          ","tn402881cf":"Collin Moore","tn2bf5a469":"ATTORNEY AT LAW","tn35c672bc":"About Collin","t1441e999":"Academic Excellence","tn7968bbd6":"Awards and Memberships","t661d8788":"Education","t5a0ea5a1":"Thank you! Your submission has been received!","tn7c112e99":"Oops! Something went wrong while submitting the form.","tn7d6c0869":"Attorney At Law","tn1eab6368":"We worked with Collin Moore for my wife's traffic violation and hit and run charges. Collin is very professional and thorough with his approach. This case took more than 8-9 months, He took care of all the court dates, was always on top of all the issues and finally managed to get all the charges dropped. We would rate him very highly for his services. ","tn7a4d51e2":"- D.S., Sunnyvale, CA In the News","t5ab866b5":"Mr. Moore commented on KRON4 regarding Lindsay Lohan’s case and was asked to explain what happens when a person on probation doesn’t comply with the terms.","tn607e427d":"Memberships San Francisco Trial Lawyers Association","t6fbaf8ba":"Honors and Awards – CALI Award for Law &amp; Literature Class (top student in the class)"},"textarea":{"ta170f068d":"Request a Free <br>Consultation","tan26c7b998":"Collin Moore believes that his job is to analyze each client’s individual situation, develop a strategy to solve the client’s needs and then fight for his client to obtain the best possible result. His goal in all cases is either dismissal or a win at trial.<br><br>Mr. Moore attended law school at the prestigious University of San Francisco School of Law (USF). While at USF, he prepared himself to become an excellent advocate for his clients. Collin not only excelled academically, but he also focused on developing the negotiation and advocacy skills he knew he would need to successfully represent his clients in the real world.<br>","ta3db714ad":"While in Law School, Mr. Moore received several awards for academic excellence including the CALI award for Law &amp; Literature and the 2006 Advocate of the Year Quarterfinalist.<br><br>A standout student, Mr. Moore was selected to become a member of the USF Mediation clinic where he defended the civil rights of clients and negotiated solutions to legal issues at the San Francisco Superior Court. Collin also participated in the Intensive Advocacy Program – a program where some of the nation’s top trial attorneys, including respected prosecutors and defense attorneys, worked with Collin to develop the skills he would need as a trial attorney. Many of the instructors told Collin that he had “great instincts” and “was a natural.”<br><br>After law school and prior to joining Summit Defense Attorneys, Mr. Moore worked for another Bay Area law firm where he was further able to hone his skills representing clients in both State and Federal Court. Mr. Moore negotiated many successful resolutions of his clients’ legal problems and put his advocacy skills to good use developing and implementing winning trial strategies.<br><br>Many of Collin’s former clients have mentioned how much they appreciate the fact that Collin is honest and straightforward with them when discussing their cases. He believes that the one of the keys to obtaining great results is building great relationships.<br><br>Collin’s other passions, apart from law, are fly fishing and brewing beer. Prior to attending law school, Mr. Moore taught fly fishing to clients around the U.S. and abroad. He has also won awards for his great home brew.","tan1827921f":"Awards &amp; Memberships:<br>","ta671a89b6":"Years in practice – 7<br>","ta3ab79b2":"EDUCATION:<br>","tan6335e93a":"School of Graduation - University of San Francisco School of Law<br>"},"richtext":{},"iframe":{"i23b14ba3":"https://www.youtube.com/embed/XWGzu7xNrB4?rel=0&controls=1&autoplay=0&mute=0&start=0"}}