{"img":{"in8782bbc":{"src":"/assets/images/polygon-6.png","alt":"","sizes":""},"ic8a39f4":{"src":"/assets/images/image.jpg","alt":"","srcset":["/assets/images/image-p-500.jpeg 500w","/assets/images/image.jpg 694w"],"sizes":"(max-width: 767px) 90vw, (max-width: 991px) 87vw, (max-width: 1279px) 85vw, (max-width: 1439px) 83vw, (max-width: 1919px) 1087px, 1460px"},"i4b82d9af":{"src":"/assets/images/group-228-1.png","alt":"","sizes":""},"i969ffa0":{"src":"/assets/images/arrow-left.png","alt":"","sizes":""},"i519f0e04":{"src":"/assets/images/arrow-left-1.png","alt":"","sizes":""},"in319d2851":{"src":"/assets/images/left-quote-1.png","alt":"","sizes":""}},"link":{"a3e8a0f":"tel:(510)877-8356","a77f0b049":"https://www.google.com/maps/dir//Summit+Defense,+2570+North+1st+Street+Second+Floor,+San+Jose,+CA+95131/@37.3837136,-122.0058958,12z/data=!4m8!4m7!1m0!1m5!1m1!1s0x808fcbdfbd640229:0x9b16a103d209bfbc!2m2!1d-121.924981!2d37.385185","a23":"#"},"text":{"t6b95e228":"OAKLAND CALIFORNIA OFFICE","t1eb5faac":"Phone : (510) 877-8356","t6be30b0d":"Driving Directions","t2268ff":"Home","t5e12e791":"\n            <a href=\"/\" class=\"breadcrumb-links\" data-text=\"t2268ff\">Home</a> » <a href=\"firm-locations\" class=\"breadcrumb-links\">Locations </a>» Oakland Criminal Defense Attorneys\n          ","tn2d478f5e":"Locations ","t4466b4f3":"\n                <a href=\"contact-us\" target=\"_blank\" class=\"link-13\" >1-866-903-3141</a> to get in touch with our defense attorneys and schedule your free case evaluation today.<br>\n              ","t3d024ddd":"1-866-903-3141","t64ac2f24":"Courts in Oakland That Handle Criminal Cases","tn3a12a288":"Rene C. Davidson Courthouse","t64c6cd4d":"1225 Fallon Street","t6a8208dc":"Wiley W. Manuel Courthouse","t4eb717a4":"661 Washington Street","t60e8ac5c":"Glenn Dyer Jail (GDJ)","t5cd46223":"Santa Rita Jail","tn2202556f":"Most inmates in Alameda County, including Oakland, are taken to this jail located at 5325 Broder Blvd., Dublin.","tn1ee56c05":"Driving Directions to Our Law Office in Oakland, CA","tn72bbea06":"Get on Martin Luther King Jr Way going South, passing through South Berkeley and Bushrod. Following signs for Downtown Oakland, merge onto CA-24 W. If you’ve passed Grove Shafter Park and Hoover Elementary School, you’re on the right path. Take the 27th St exit towards Grand Ave. and continue onto Northgate Ave. Take a left onto 23rd St, and then a right onto Telegraph Ave. If you pass Drake’s Dealership, you’ve gone too far. Follow Telegraph Ave for four blocks and then turn left onto 20th St. Our office will be on the right side of the street, kitty-corner to the Paramount Theatre.","tn4241c760":"Get on Lincoln Ave going West. Take a right onto Constitution Way. Continue North, merging onto Webster St, and then Posey Tube, passing Marina Village Shopping Center, In-N-Out Burger, Jack London Square, and Chinatown. Posey Tube will turn into Harrison St, follow this for .7 miles until 19th St. Take a left, passing 19th Street Station and Sweet Belly Desserts on your left. Once you reach Broadway, take a right. Our office will be on your right at the end of the block.","t2e24d204":"Get onto I-80 E, crossing over the water into Oakland. Once you see McLaughlin Eastshore State Park on your left, merge from I-80 to I-580 for 1 mile. Take exit 19C toward CA-24/Hayward/Stockton. After .6 miles, take the 27th St. exit, you might see Durant Mini Park on your right as you exit. Now on Northgate Ave, continue for .2 miles. Take a left onto 23rd St, before you reach Blum Oak. After one block, take a right onto Telegraph Ave., passing Oakland Valero Gas on your left. Continue until you reach 20th St., take a left, and our office will be on your right after one block.","tn4ebb0c7c":"related links","t32adc02e":"Domestic Violence - Oakland","tn547a7a49":"Sex Crime - Oakland ","t4e8f7c57":"DUI - Oakland ","t5073604e":"Successful Case Results in OAKLAND &amp; ALAMEDA","tn4252db9c":"Burglary","t3819d92a":"Possession of child porn","tn4b440311":"Robbery","t59715baf":"Possession with intent to sell","t6f7ec777":"Berkeley","t8cddb59":"Best criminal lawyers in Oakland. My case went to trial and I cant imagine where I would be without their help. Jim Riley is a genius and was always clearly the most knowledgeable person in court. Obviously I am very happy with the result.","t71808121":"Can’t speak highly enough of Rabin Nabizadeh. Attentive, calm and very good at his craft. Managed to handle my severe anxiety and, at the end, get the case dismissed on the day of trial. Highly recommend.","t19da68e8":"About a year into fighting a DUI, my attorney got ill and recommended Rabin Nabizadeh to do the trial. &nbsp;I had pretty much refused to do any tests and wanted a dismissal in the case. &nbsp;Mr. Nabizadeh was absolutely relentless and convinced 12 jurors to find me not guilty. &nbsp;Years later, we are friends on Facebook.","tn76f122cf":"I will never forget the call I got about my son’s arrest for murder. &nbsp;Having never been through anything like that, I relied on my business lawyer for a referral and he immediately called Mr. Riley. &nbsp;Within minutes of meeting him, I knew I was in good hands as he was able to provide much needed perspective. &nbsp;Mr. Riley was able to reduce the bail (was set at one million) and after almost two years, resolve the case with no additional jail and an eventual dismissal. &nbsp;Collin Moore and the rest of the gang were amazing and always available. "},"textarea":{"tan6827e412":"<br>OAKLAND CRIMINAL DEFENSE ATTORNEY<br>‍","tan39084577":"If you’ve been accused of a <strong>misdemeanor</strong> or a serious <strong>felony</strong> – whether in Alameda or Contra Costa county – an Oakland criminal defense attorney can help. At Summit Defense, our goal is always the <strong>complete dismissal of all charges</strong>. If this isn’t possible, we often negotiate solutions for our clients that allow them to avoid jail and sometimes even prosecution.","tan21ffe873":"<strong class=\"bold-text-18\">Summit Defense</strong><br>1970 Broadway, #1145, Oakland, CA 94612","ta782e1f5":"<strong class=\"bold-text-22\">Contact us online</strong>","ta20":"<strong class=\"bold-text-22\"> </strong>","ta23e97d61":"CRIMINAL DEFENSE LAWYER<br>","tan3f1dbde5":"<strong>Location: Oakland, CA<br></strong>Summit Defense is seeking an experienced criminal defense attorney for our Oakland, CA office.<br>‍<br><strong>Duties:<br></strong>The qualified candidate will work under the supervision of a senior attorney to provide research and writing support to a staff of criminal law attorneys. Other responsibilities include handling a small misdemeanor case load and writing content for law firm’s website.<br><br><strong>Requirements:<br></strong>Education/Experience: Requires active California Bar license and one year of experience as an attorney practicing criminal law.Requires one year of experience in business development for criminal defense law firm.<br><br><strong>Interested applicants: </strong>Please send resumes to David Nguyen: <a href=\"mailto:david@summitdefense.com\">david@summitdefense.com</a> and Rabin Nabizadeh: rabin@summitdefense.com<br><br><em>Summit Defense is Northern California’s largest Criminal Defense Law Firm that only represents individuals charged with or accused of a crime. The Summit Defense legal team includes three former prosecutors, a former Police Officer, a Board Certified Appellate Specialist and attorneys who graduated from the country’s top law schools.</em><br><strong><br></strong>","ta6067545b":"Location: Oakland, CA<br>","tan249d575a":"Duties:<br>","ta7e82158a":"Requirements:<br>","ta3fbe8166":"<br>","ta3f1cbfdc":"There are two courthouses where criminal cases are dealt with in Oakland, both in the Downtown area:<br>","tan6c6db989":"<strong>Cases Handled:</strong> Felony cases only.","tan15c2e551":"Phone:<br>‍<a href=\"tel:(510)891-6000\" class=\"link-9\">(510) 891-6000</a>\n                ","tac8f6eb3":"<strong>Cases Handled: </strong>Traffic Court<br><strong>Court Calendar: </strong>\n                  <a href=\"http://www.alameda.courts.ca.gov/Pages.aspx/Find-Your-Court-Date\"><strong>Find Your Court Date</strong></a>\n                ","ta1d98c309":"<strong>Find Your Court Date</strong>","tan8c9de4f":"Phone:<br>‍<a href=\"tel:(510)627-4700\" class=\"link-8\">(510) 627-4700</a>\n                ","ta288d3821":"This is is the closest jail to Oakland and houses exclusively male inmates.<br><br>‍<a href=\"https://www.alamedacountysheriff.org/dc_gdj_visiting.php\">Visiting Schedule</a> – If you’re not sure where an inmate is being held, you can find <a href=\"http://www.acgov.org/sheriff_app/\">inmate information online.</a>\n                ","ta4d6ac41b":"From North (Berkeley)<br>","ta3669d94b":"<strong>From East (Montclair)</strong><br>","ta77eb2cad":"Drive South-West onto Park Blvd. After passing through Crocker Highlands, merge onto I-580 W towards Berkely/San Francisco. Continue on I-580 W after passing the Grand Lake Theatre and Lake Merritt on your left. Take exit 19D to merge onto I-980. Take the 27th St exit and follow Northgate Ave until you reach 23rd St, at which point you’ll take a left. Once you reach Telegraph Ave., with the Telegraph restaurant on your left, take a right. Once you reach the Great Western Power Company on 20th St, take a left onto 20th. Drive one block and our office will be on your right, next to Donut Savant.<br>","tan3095c3e3":"<strong>From South (Alameda)</strong>","ta74e97576":"<strong>From West (San Francisco)</strong><br>","ta45308d31":"<strong>Client</strong>: Bryan V.<br><strong>Location</strong>: Oakland<br><strong>Attorney</strong>: Collin Moore<br><strong>Charge(s):</strong> Burglary with one prior strike<br>‍<br>Client was arrested while in custody for a burglary conviction. The second burglary predated the plea entered with Public Defender.<br><br>‍<strong><em>Result </em></strong><em>– Second Burglary charge reduced to non-strike and time ran concurrent with resolved case.</em>","tan5b5c2c7d":"<em>Result </em>","tancb6d575":"<strong>Client:</strong> Brian H.<br><strong>Location:</strong> Alameda<br><strong>Attorneys:</strong> Rabin Nabizadeh<br><strong>Charge(s): </strong>Possession of child porn, annoying or molesting a child.<br>‍<br>Client was caught by party goers zooming his video camera on minor sitting at party. After preliminary examination, we argued that the materials were, in fact, not child pornography according to statute and case law. The court disagreed and denied motion to dismiss. We filed a penal code 995 motion to review of court’s earlier decision. In a complete reversal of stance, the district attorney submitted that while the images focuses on minor’s crotch area, they did not co statute child porn.<br><br>‍<strong><em>Result</em></strong><em> – Case dismissed.</em>","tan6e4d4bc3":"<em>Result</em>","tan7de43bd5":"<strong>Client:</strong> Darian H<br><strong>Location:</strong> Alameda<br><strong>Charge(s):</strong> Robbery<br>‍<br>Client and peers committed a total of seven robberies including a bank in a period of three weeks. &nbsp;Client was caught on camera in several of the robberies and codefendant was presumed to testify against our client.<br><br><strong>‍<em>Result</em></strong><em> – After detailed mitigation packet submitted, client entered a plea to non-strike felony with credit for time served.</em>","ta8cbd68a":"‍<em>Result</em>","tan3581caa0":"<strong>Client:</strong> Armando V.<br><strong>Location:</strong> Oakland<br><strong>Attorney:</strong> Richard Weese, Jim Riley<br><strong>Charge(s):</strong> Possession with intent to sell<br><br>Client was charged with possession with intent to sell after an undercover sting. Previous attorney advised client to accept a six month plea deal, which client refused. After several interview, client decided to proceed to trial.<br><br><strong>‍<em>Result –</em></strong><em> At one of the most hilarious trials in our history, eleven jurors submitted a not guilty verdict. The District Attorney attempted to refile the case, but the court dismissed in light of overwhelming juror opinion.</em>","ta5307ffd":"‍<em>Result –</em>","tan4febd617":"Client <span class=\"header-spanv\">Testimonials</span>","ta1b11ee9a":"Real People. <span class=\"header-spanv\">Real Stories.</span>","ta1e97e53b":"<br>Thank you Collin and Rabin for all your tireless work. I can imagine dealing with me was difficult. I am glad I found you.","ta4c5a713":"<strong>Sohel</strong>","tan6a4ae75f":"Nirvesh R.<br>","ta7017e160":"<strong>Ibrahim J.</strong>","ta562d6156":"Berkely<br>","ta7992f33b":"<strong>Dan B.</strong>","tan1573ddc":"Oakland<br>","ta725dd2cd":"<strong>David M.</strong>"},"richtext":{"rn66256a09":"\n              <h3>CONTACT OUR TEAM OF DEDICATED AND SKILLED OAKLAND CRIMINAL DEFENSE ATTORNEY</h3>\n              <p>At Summit Defense, we provide over 120 years of cumulative criminal defense experience in both private and public litigation throughout Oakland CA, the San Francisco Bay Area, and all of Northern California.<br><br>We understand just how important it is for you to work with a reputable criminal defense law firm that has supported past clients with similar criminal charges that you or your loved one is currently facing, and you’ve come to the right place online to secure a high-quality Oakland criminal defense attorney.<br><br>Our Oakland criminal defense lawyers will provide you with the legal advice that you need during your free case evaluation, and we’ll always do whatever it takes to help you avoid jail time and obtain your most favorable outcome. <br><br>‍<a href=\"contact-us\" target=\"_blank\">Contact us online</a> or call our law offices at 1-866-852-0507 to schedule your free consultation with our criminal defense attorneys today.</p>\n              <h3>OUR OAKLAND CRIMINAL ATTORNEYS HANDLE ALL TYPES OF CASES</h3>\n              <p>It’s always a very stressful situation when you or a loved one is facing criminal charges, and you’re going to need expert criminal defense lawyers to take on your case no matter what your criminal record entails.</p>\n              <p>Our law firm can support you no matter what criminal offense you’re currently dealing with, and some of the most common <a href=\"crimes-we-defend\" target=\"_blank\">crimes we defend</a> include the following:</p>\n              <ul role=\"list\">\n                <li>Domestic violence cases</li>\n                <li>Assaults</li>\n                <li>Assaults with a deadly weapon</li>\n                <li>Animal abuse</li>\n                <li>Battery that causes serious bodily injury</li>\n                <li>Battery of a law enforcement officer</li>\n                <li>Child molestation/pornography</li>\n                <li>DUI/DWI cases</li>\n                <li>Drug crimes</li>\n                <li>Embezzlement</li>\n                <li>Expungement</li>\n                <li>Grand theft</li>\n                <li>Federal cases</li>\n                <li>Indecent exposure</li>\n                <li>Hit and run</li>\n                <li>Sex offenses</li>\n                <li>Marijuana law</li>\n                <li>Shoplifting and petty theft</li>\n                <li>Probation violation</li>\n                <li>Professional and small business licensing</li>\n                <li>Rape</li>\n                <li>Prostitution and massage parlors</li>\n                <li>Sex offender registration</li>\n                <li>Solicitation</li>\n                <li>Statutory rape</li>\n                <li>And much more…</li>\n              </ul>\n              <p>Although public defenders may be possible for you when you’re involved with these types of criminal cases, your best bet of having your case dismissed is to hire an experienced legal team that has your best interests at heart.</p>\n              <h3>WHAT TO LOOK FOR IN A CRIMINAL DEFENSE LAWYER?<br></h3>\n              <p>Finding a high-quality criminal defense lawyer is always a lot easier said than done, and these hiring decisions are so crucial due to the serious consequences of not obtaining your most favorable legal outcome.</p>\n              <p>We’ve been serving Oakland for many years and know the district attorneys personally, so you can count on our legal team to aggressively defend your legal issues. Some of the things you should be on the lookout for when hiring a criminal defense lawyer include:</p>\n              <ul role=\"list\">\n                <li><strong>Look Past Fancy Infographics:</strong> There are countless defense attorneys that will utilize all sorts of advertisements to lure people into their law offices, but you should know that a lawyer’s services are what truly matter. Your attorney’s priority should be to settle your case as efficiently as possible, which means that it’s on you to check out their <a href=\"https://www.summitdefense.com/case-results/\" target=\"_blank\">case results</a> and <a href=\"https://www.summitdefense.com/reviews/\" target=\"_blank\">reviews</a> prior to finalizing any decision.</li>\n                <li><strong>Responsiveness: </strong>Time is always a critical factor within all criminal cases, so you’ll need an attorney-client relationship that puts your criminal case first and ensures swift legal action. There are many reasons why prompt responses from your criminal defense firm are absolutely critical.</li>\n                <li><strong>Cost:</strong> Some defense attorneys will work on a contingency basis, whereas others will want upfront payments and even consultation fees. It’s important to work with criminal defense lawyers that value transparency with their cost of services because hidden fees are something you should be extra cautious about!</li>\n                <li><strong>Legal Specialization:</strong> Making sure that your defense attorney is qualified to handle your case is important because there are many specialized areas of interest within defense law that a lot of Oakland criminal defense lawyers may not be experienced within. Criminal charges like DUI/DWI may require a DUI defense lawyer, and domestic violence may also require specific types of criminal lawyers.</li>\n                <li><strong>Personal Characteristics:</strong> Some of the personality traits to be on the lookout for include good communication skills, aggressive, friendly, confidential, personal involvement with your criminal case, and a lot more…</li>\n                <li><strong>Experience:</strong> Having an experienced attorney will always benefit you and your criminal defense charges because this portion of the law requires many years of courtroom knowledge and relationships with law enforcement and district attorneys.<br></li>\n              </ul>\n              <h3>3 REASONS TO CHOOSE SUMMIT DEFENSE AS YOUR AGGRESSIVE OAKLAND CRIMINAL DEFENSE ATTORNEY</h3>\n              <p>Although there are many reasons why you should choose Summit Defense as your Oakland criminal defense lawyers, the following three reasons are important to keep in mind:</p>\n              <ul role=\"list\">\n                <li><strong>We’ve Earned Countless Victories In Oakland CA Courts:</strong> Our <a href=\"https://www.summitdefense.com/attorneys/\" target=\"_blank\">attorneys</a> have an incredible track record of success within Northern California courts, and we’ve won some incredibly tough cases against hard-nosed district attorneys. Check out our <a href=\"https://www.summitdefense.com/case-results/\" target=\"_blank\">case results</a> page for more information about our past success.</li>\n                <li><strong>Having The Best Of The Best On Your Side:</strong> The defense attorneys at Summit Defense don’t back down from a legal fight, so when you hire us you can rest assured that you’re working with the very best law firm no matter what crime you’re accused of.</li>\n                <li><strong>Helping You Know What To Expect After An Arrest:</strong> There’s no denying that the legal process can be confusing after you’ve been arrested for a crime, so having legal expert support you through these moments will put you and your criminal record in the best position for a favorable outcome.</li>\n              </ul>\n              <h3>BENEFITS OF WORKING WITH US<br></h3>\n              <p>Our <a href=\"https://www.summitdefense.com/reviews/\" target=\"_blank\">client testimonials</a> will provide a good glimpse into some of the many benefits of working with us, and some of the more common benefits that you should know about include:</p>\n              <ul role=\"list\">\n                <li><strong>A History Of Good Criminal Case Results:</strong> We’re a successful criminal defense firm because of the countless results we’ve provided to our clients, and our aggressive approach has developed our reputation for proven defense victories.</li>\n                <li><strong>Reputation For Excellence:</strong> Our law office has become known throughout Oakland CA for successfully serving our clients with the highest levels of responsiveness and integrity.</li>\n                <li><strong>We’re Trusted Throughout The Community:</strong> Our legal team includes former public defenders, super lawyers, and former district attorneys. We also have good working relationships with law enforcement offices throughout Oakland and the entire San Francisco Bay Area.</li>\n                <li><strong>Our Team Has Three Former Prosecutors:</strong> We have over 120 years of cumulative criminal defense experience on both sides of the industry, so we have the talent and insight to handle all kinds of criminal cases.</li>\n                <li><strong>We’re A Multicultural Team:</strong> In Northern California there are countless situations in which defense attorneys need to be able to speak Spanish, and our Spanish-speaking lawyers and staff members will be able to serve people who primarily speak Spanish.</li>\n              </ul>\n              <h3>OAKLAND CRIMINAL DEFENSE FAQs<br></h3>\n              <p>The following are some frequently asked questions oriented around criminal defense law:<br></p>\n              <h3>SHOULD I HIRE AN ATTORNEY PRIOR TO BEING ARRESTED IF I SUSPECT THAT I MAY BE ARRESTED?<br></h3>\n              <p>In many situations, it is a good idea to obtain legal representation when you suspect that you’ll be arrested, and this type of legal service is referred to as “pre-charge representation”.</p>\n              <p>If you’re being investigated or you are certain that you’ll be accused of a crime, then hiring a defense attorney to be by your side will support your efforts to eventually obtain a favorable outcome.</p>\n              <h3>WHAT IS GOING TO HAPPEN IN THE FIRST 72 HOURS AFTER I’VE BEEN ARRESTED ON A CRIMINAL CHARGE?<br></h3>\n              <p>When you’ve been arrested, you’ll inevitably be taken to jail to be placed in a holding cell. You’ll then be booked and fingerprinted, and then you’ll have an opportunity to reach out to a bail bondsman once your bail has been established. If you’re not bailed out, you’ll be brought into court for an initial appearance. This is when you’ll officially figure out what charges are filed against you and whether or not you’ll be released from custody.</p>\n              <p>The District Attorney has only 2-3 days to file charges against you when you are in custody. It will be absolutely critical that you reach out to our attorneys so we can represent you during these initial court hearings and hold the Oakland CA court system fully accountable.<br></p>\n              <h3>IS IT EVER POSSIBLE TO HAVE VIOLENT CRIME CHARGES REDUCED?</h3>\n              <p>Yes, and there are many unique ways in which violent crime charges can be reduced. Negotiation is always your best strategy when it comes to reducing criminal charges, and felony charges will entail a Preliminary Hearing in which a judge will determine whether or not the District Attorney has probable cause to charge you with your crimes.</p>\n              <p>There may be an opportunity for you to have your charges reduced during your Preliminary Hearing, which is another reason why it’s so important to hire an experienced Oakland criminal defense attorney to represent you during these types of serious legal troubles. Plea bargaining with violent felonies is relatively not available in Northern California due to state law, but what you can do is negotiate with the prosecutor to re-file for different charges.</p>\n              <p>Our legal team has close relationships with District Attorneys throughout California and the entire San Francisco Bay Area, which goes a long way in supporting your efforts to have these types of serious charges reduced.</p>\n              <h3>DOES EXPUNGEMENT APPLY TO CHARGES ONLY, OR DOES IT COVER CONVICTIONS AS WELL?</h3>\n              <p>\n                <a href=\"https://www.americanbar.org/groups/public_education/publications/teaching-legal-docs/what-is-_expungement-/\" target=\"_blank\">Expungements</a> are directly related to convictions. If you weren’t convicted of a crime, then an expungement wouldn’t be necessary.\n              </p>\n              <h3>DO MOST CRIMINAL CASES GO TO TRIAL OR DO THEY SETTLE?</h3>\n              <p>Most criminal cases will result in a negotiation with the District Attorney and won’t necessarily go to trial, and there are many scenarios in which it’s in a client’s best interest to weigh other options besides going to trial.</p>\n              <p>Negotiating a charge reduction, early probation termination, or dismissal after a year has passed can many times be a better route for an individual facing criminal charges as opposed to going to trial.</p>\n              <p>However, when the right circumstances apply, the Summit Defense team will be prepared and ready to take your case to trial and ensure that your case is dismissed.</p>\n              <h3>CONTACT OUR OAKLAND CRIMINAL DEFENSE ATTORNEYS TO GET A FREE CONSULTATION</h3>\n              <p>When you or a loved one has been arrested on criminal charges, it’s critical to hire a criminal defense lawyer to help you better understand your legal rights and represent you within every appropriate scenario.</p>\n              <p>The Oakland criminal defense attorneys at Summit Defense have supported countless individuals going through serious legal troubles, and our team will be there for you through every step of these complex and stressful procedures. We understand how legal representation can make or break your freedom and your long-term future, and we take these responsibilities very seriously.</p>\n            ","r74e299fd":"\n              <h3>Highly Rated Criminal Defense Lawyer in Oakland, California</h3>\n              <p>\n                <a href=\"https://g.page/summit-defense-oakland?share\">Summit Defense</a> is located on 1970 Broadway #1145, <a href=\"https://goo.gl/maps/rHkgPqBRkGdrP4kv8\">Oakland</a>. From <a href=\"https://goo.gl/maps/JPZSgxctRryMsM2C9\">San Francisco International Airport (SFO)</a> head northwest and keep left at the fork to continue toward Airport Access Rd. Then keep left at the fork to continue toward Airport Access Rd and continue onto Airport Access Rd. Next, use the left lane to turn slightly left to stay on Airport Access Rd and continue straight to stay on Airport Access Rd. After that, make a U-turn and use the 2nd from the right lane to keep right at the fork, follow signs for US-101 N/San Francisco and merge onto US-101 N. At this point, use the right 2 lanes to take exit 430A to merge onto I-280 N and continue onto King St. Turn left onto 3rd St and turn right onto Bryant St. Now turn left onto the I-80 E ramp and keep left and merge onto I-80 E. Use the right 3 lanes to take exit 8B for I-580 E toward Downtown Oakland/Hayward/Stockton/CA-24 and continue onto I-580 E. At 0.6 miles, use the right lane to take exit 19C toward Downtown Oakland/I-980 W and keep right, follow signs for 27th Street/West Grand Ave. Continue onto Northgate Ave and turn left onto 23rd St.Continue and turn right onto Telegraph Ave. Finally, turn left onto 20th St/Thomas L Berkley Way and Summit Defense will be on your left.\n              </p>\n              <p>We’re open 24 Hours.</p>\n              <p>For additional questions you can call us at (510) 877-8356 or you can find us on <a href=\"https://www.yelp.com/biz/summit-defense-oakland\">Yelp</a>.</p>\n              <p> </p>\n            "},"iframe":{"i-21e062be":"https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d50434.22131052!2d-122.27138799999999!3d37.810217!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x0%3A0x2b494639c533e5bc!2sSummit%20Defense!5e0!3m2!1sen!2shr!4v1634106784282!5m2!1sen!2shr"}}